[
{"job_desc": " The Flickr community is home to tens of billions of photos and 2 million groups. Come for the photos, stay for the community.\n About Oath\n Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.\n \n Tripod Oath in Three Words:  “We Love Pixels”\n Your Day\n As a backend Java developer on the Tripod project you will be responsible with the design, deployment, and maintenance of one or more segments of the project. Most likely this will include a specific service or suite of features that you ultimately “own” and take responsibility for. This will involve:\n Requirements solicitation from customers, managers, and your Tripod teammates\n High-level architectural design discussions in order to cooperatively integrate and implement your components\n Writing well-crafted Java code (or other languages)\n Participating in peer reviews of code changes\n Supporting your software as needed during (hopefully infrequent) production incidents\n A Lot About You\n You must have experience with:\n Bash shell scripts\n Java\n Git command line for branching, merging, pull-requests, and commits\n Data structures like hashmaps and linked lists including best/worst/average complexity, proper usage, and creative application\n Design patterns like abstract factories\n Fundamental understanding of multithreading concepts like race conditions, deadlock, semaphores, locking, etc.\n Quality engineering concepts like writing tests and edge cases\n Preferred Qualifications:\n Spring Application Framework\n GitHub web UI\n An advanced IDE like IntelliJ, Eclipse, or NetBeans (brownie points for IntelliJ or any JetBrains IDE application)\n JUnit, Mochito, or any other test frameworks or tools\n Jenkins\n Experience with distributed system architecture\n Experience with databases (MySQL, PostGre, SQLite, Oracle, etc.)\n Experience with NoSQL data stores (Redis, Mongo, etc.)\n Experience with messaging services (JMS, Kafka, RabbitMQ, etc.)\n Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for all employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process by contacting us at hr-benefits@oath.com, or call us at 1-866-772-3182.\n Submission of this information is voluntary and refusal to provide it will not subject you to any adverse treatment.\n Currently work for Oath? Please apply on our internal career site."},
{"job_desc": " Job Summary Job Summary:  Design, develop, document, test, and debug complex and large scale real-time software products, systems and/or applications. Use Core Java, iOS, Android, Objective C and/or Swift to develop software. Participate in full development life cycle including requirements analysis, design, develop and support. Write technical specifications based on conceptual design and stated business requirements. Support, maintain, and document software functionality. Identify and evaluate new technologies for implementation. Analyze code to find causes of errors and revise applications as needed. Participate in software design meetings and analyze user needs to determine technical requirements. Consult with end-user to prototype, refine, test, and debug applications to meet needs. Conducts routine tasks as directed. Qualifications and Skills Qualifications:  Bachelor’s Degree with internships as a Java Developer (this is an entry level role) Job Type: Full-time Required education: Bachelor's"},
{"job_desc": " \n Collaborate with business and front-end teams to shape ideas into usable applications \n Design, implement, test and deliver features \n Support and improve existing Python code base and processes \n \n Requirements: \n \n Experienced in writing readable, stable, modular, testable and sustainable code \n History of working individually and as a team member on systems made up of complex, interconnected software services \n BS in Computer Science or comparable experience \n Fluency in Python, SQL \n Familiarity with web application frameworks like Django \n Familiarity with lower level systems, i.e. operating systems, database servers and networking protocols \n Driven by experimentation and collaboration \n \n Benefits: \n \n Health, Life & Disability Insurance \n \"Reset & Recharge\" unlimited vacation policy \n Retirement Plan \n Incentive Compensation \n \n"},
{"job_desc": " \n Collaborate with business and backend teams to shape ideas into usable applications \n Design, implement, test and deliver features \n Support and improve existing JavaScript, React code base and processes \n \n Requirements: \n \n Experienced in writing readable, stable, modular, testable and sustainable code \n History of working individually and as a team member on systems made up of complex, interconnected software services \n BS in Computer Science or comparable experience \n Fluency in JavaScript, HTML and CSS \n Familiarity with libraries like React and Foundation \n Familiarity with lower level technologies like RESTful APIs \n Driven by experimentation and collaboration \n \n Benefits: \n \n Health, Life & Disability Insurance \n \"Reset & Recharge\" unlimited vacation policy \n Retirement Plan \n Incentive Compensation \n \n"},
{"job_desc": " As a recent university grad, you’ll contribute meaningfully to our top-notch engineering team. Recent grads in the past have built a real-time high-throughput data processing pipeline that ties our infrastructure together, built out our proprietary financial platform that is central to our long term company mission, and built out our extensive automated testing framework.\n \n \nYou’ll be building out new features on a team that fits your skillset and interests. We look for students that have a passion to change the consumer finance industry for the better. Past experience with some or all of the below requirements is a plus!  \n \n What You'll Do\n According to your interests and experience, you’ll work on Product Engineering, Platform Engineering, or Infrastructure Engineering teams. We welcome students with technical interests in Front End, Full Stack, and/or Backend development. We'll be in conversation during the entire interview process to determine which team bests matches your skill-set and interests.  What We Look For\n Experience with one of the following languages: Python, C/C++, Java, and/or Javascript\n Continuous deployment and automated testing frameworks\n Front End experience with WebApp/JavaScript/AngularJS/React\n Developer API development/documentation AWS or other PaS frameworks\n Strong understanding of operating system internals\n Passion and drive to change consumer banking for the better\n ABOUT AFFIRM  \nAt Affirm we are using technology to re-imagine and re-build core parts of financial infrastructure to enable friendlier and more transparent financial products and services that improve lives.\n \n \nWe believe the financial industry is fundamentally broken. Not only is the core infrastructure built with technology from the 1970s, but there are a dwindling number of people who say \"I trust my bank to look out for me\". It doesn’t have to be this way, and it’s our mission to fix this problem.\n \n \nWe are based in San Francisco; founded by Max Levchin (founding CTO of PayPal), Jeff Kaditz (CDO DeNA/ngmoco), and Nathan Gettings (founding CTO of Palantir); and building a team of exceptionally talented people to join us on our mission."},
{"job_desc": " Who We Are:\n \n \nTwitter’s Brand advertising team is Twitter’s revenue innovation center, creating products used by the world’s biggest brands. From the company that invented native advertising (ads that look and feel the same as organic content), it’s at our core to build products that feel natural and authentic to our platform. Come build the next generation of products that empower marketers to tell the most interesting, relevant stories in the world, and make a meaningful contribution to an iconic company.\n \n \n Who You Are:\n \nYou are experienced in implementing complex, extensible, and reusable Web components across Desktop and Mobile browsers.\n \n \nYou enjoy taking on challenges where you’ll be responsible for scoping full feature integrations with product managers, designers, and other engineers across our organization.\n \n \nYou have tinkered with full-stack development, but love making pixel perfect front-end products and features.\n \n \n What You’ll Do:\n You will be working on integrating revenue products across the array of Twitter Web clients, and coming up with frameworks and integrations to streamline the development of such.\n Maintain ownership over the frameworks, features, and integrations you engineer, while helping speed-up the development of new products and features.\n Reach millions, maybe billions, of users with your work!\n \n We’d like to talk to you if:\n You have experience working with modern Web technologies, including React, and have full-stack experience with any back-end language, but Scala or Java a plus.\n You have deep knowledge of developing and working on APIs.\n You enjoy creating high-performing solutions that can degrade based on rendering environments and their configurations.\n You know the importance of testing and automation, and consider that a core requirement to everything you build.\n You never really used jQuery because you thought Vanilla JS was higher performing."},
{"job_desc": " Title: Software Engineering/Computer Science, Intern\n \nLocation: San Francisco\n \n \nSalesforce is seeking a highly motivated and creative Software Engineering/ Computer Science Intern to develop, test, implement, and support mission critical business applications and or tools within the Alliances & Innovation organization.\n \n \nThis role requires analytical, problem solving and production support skills to investigate, reproduce and diagnose complex technical issues affecting Alliances internal business operations. Passion to develop and implement configurable and scalable solutions to business problems is highly desirable. Technical skills are important, but so are persistence, patience and communication. Responsibilities:\n \n Lead the resolution of critical technical issues, providing prompt and complete analysis of technical challenges and business issues\n Documentation and testing of new software applications\n Assessment of new application ideas\n Scaleable Process Design and Architecture\n Working with stakeholders to help refine requirements and develop to those requirements\n Designing, developing new force.com applications, integrations as well as maintaining existing force.com applications and integrations.\n Interview beta testers\n Participate in special projects and perform other duties as assigned  Required Skills/Experience:\n Currently pursuing BA/BS in Computer Science/Network Engineering, Engineering, Mathematics, Computer Information Systems\n Passionate and knowledgeable about exploring and experimenting with the latest app development technologies\n Excellent written and verbal communication skills\n Ability to work in a fun, creative, and fast paced environment\n Ability to learn and adapt quickly\n Working knowledge of modern web technologies and cloud computing\n Methodical and organized; able to manage multiple opportunities, projects, and priorities concurrently.  Desired Skills/Experience:\n Understanding of enterprise and commercial software development practices, methodologies, and tools\n Passionate and knowledgeable about exploring and experimenting with the latest app development technologies\n Technical background and application development experience, including basic application development abilities on Force.com and ideally one or more of the following languages: Java, .NET, PHP, Python, Ruby\n Experience with quality assurance, user acceptance testing, creating test cases and scripts"},
{"job_desc": " In Analog, people—not devices—are at the center of everything we do. Our tech moves beyond screens and pixels, creating a new reality aimed at bringing us closer together—whether that’s scientists “meeting” on the surface of a virtual Mars or some yet undreamt-of possibility. To get there, we’re incorporating diverse groundbreaking technologies, from the revolutionary Holographic Processing Unit to computer vision, machine learning, human-computer interaction, and more. We’re a growing team of talented engineers and artists putting technology on a human path across all Windows devices, including Microsoft HoloLens, the Internet of Things, phones, tablets, desktops, and Xbox. We believe there has to be a better way. If you do too, we need you! \n \nRole description \n \nThis role is based in downtown San Francisco, where we've built a new Mixed Reality Capture Studio capable of capturing human moments and performances for integration into experiences on the latest Windows Mixed Reality devices-including HoloLens and immersive headsets-as well as other devices and media. We’re looking for experienced developers to help create the foundation of this new visual medium. In this role, you will develop and support our systems, spanning capture through processing to playback. With access to Microsoft research and product teams, you will design innovative solutions to technology problems posed by creators and consumers, developing and optimizing algorithms to make these solutions robust, scalable, and affordable. You will have a passion for improving human experience via new technologies and will thrive on working closely with creators to achieve their vision in a new medium. \n \nWhat you’ll do \n \n Design, implement, and support software features for generation of Mixed Reality Video content, emphasizing computer vision algorithms, including image segmentation, 3D reconstruction, multi-view stereo, and camera calibration. Engage with clients and users to understand their challenges, and design solutions suitable for real-world production. Deliver state-of-the-art results, balancing engineering excellence with production realities Ensure our code is fast, reliable, and architected to grow this new medium to massive scale Represent opportunities, challenges, and tradeoffs to internal and external stakeholders Foster a collaborative culture valuing technology in service of human experience \n \nWhat you'll need \n \n BS in Computer Science or related technical field; advanced degree strongly preferred 2+ years professional software development experience, emphasizing development of computer graphics and/or image processing solutions in C++ Strong knowledge of and practical experience with advanced algorithms for computer vision and image processing Passion for delivering innovative solutions to real-world users, on a deadline Excellence balancing needs of multiple short-term clients with long term technology goals Agile, flexible, and comfortable dealing with ambiguity in a startup-like environment \n \nBonus points \n \nThere are plenty of other skills that aren’t required, but you’ll find useful in this role. Let us know if you have experience with: \n \n GPGPU technologies such as OpenCL, Cuda or DirectCompute Cloud computing technologies such as Azure \n \nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to askstaff@microsoft.com."},
{"job_desc": " ServiceNow is changing the way people work. With a service-orientation toward the activities, tasks and processes that make up day-to-day work life, we help the modern enterprise operate faster and be more scalable than ever before.\n We’re disruptive. We work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving. We are passionate about our product, and we live for our customers. We have high expectations and a career at ServiceNow means challenging yourself to always be better.\n \nWe employ the brightest and most forward-thinking cloud platform developers on the planet. We have offices in San Diego, San Francisco and Santa Clara and work as a distributed team.\n \nCome join the Cloud Platform Development team and make your mark on the cloud platform for enterprise applications!\n \n What you get to do in this role: \nYou will have the opportunity to become a key member of the Cloud Platform Development group. Responsibilities include new feature development and bug fixes related to improving the reliability and scalability of our architecture. Examples of past and previous projects include implementing support for multiple databases, adding support for NoSQL as an alternative document store integrated into the platform, automated error detection and self-healing, instrumentation of the ServiceNow platform to provide new insight into performance problems.\n \nIn order to be successful in this role, we need someone who has:\n We’re looking for candidates with a range of experience\n Firm understanding of best practices for object-oriented and modularized software.\n Strong understanding of web technologies:  HTML, JavaScript, HTTP and backend programming of web applications\n Demonstrated success completing complex projects, on time\n Demonstrated aptitude for learning new technologies quickly\n Actively participate in understanding customer problems, determining product goals, and defining technical requirements\n Desired Skills\n Experience developing web applications at scale\n Experience with troubleshooting difficult production issues e.g. memory leaks, network problems, intermittent failures etc. across the stack\n Experience working in a customer focused environment\n Relational Database Experience:  Developing on, troubleshooting and optimizing performance of: Oracle, MySQL MS SQLServer\n Experience developing a platform\n We provide competitive compensation, generous benefits and a professional atmosphere. This is a very collaborative and inclusive work environment where individuals strong on aptitude and attitude will have an opportunity to grow their professional careers through working with some of the most advanced technology and talented developers in the business."},
{"job_desc": " WHAT YOU WILL DO\n \nOur stack is primarily based on Python and Java. We use Javascript, Bootstrap and AngularJS on the front-end and our databases is comprised of Google BigQuery, MySQL, Redis, Google cloud datastore.\n \nWHAT IMPACT WILL YOU HAVE\n \nYour work will impact millions of users and help create the world’s best SaaS payment system and fraud protection that will power some of the largest and fastest growing online platforms in the world.\n \nWHAT IS EXPECTED IN THE INTERVIEW\n \nWe want to see your problem-solving and analytical skills. Be prepared to write good, clean, scalable code. You don’t need to know our entire stack, but we’re looking for practical experience, someone who can solve production problems in the cloud. Our hiring processes might include:\n \n \n Online Code Challenge \n Phone Screen with Recruiter \n Technical Phone Interview with an Engineer \n On-Site Interview \n \nWHO IS WEPAY\n \nWePay, a Chase company, is the payments partner to the platform economy. It has uniquely enabled Constant Contact, GoFundMe, Meetup, and more than 1,000 other B2B and B2C platforms to provide integrated payments processing without compromising on their user experience or taking on risk and regulatory exposure. WePay is a two-time honoree on the Inc. 500 fastest-growing private companies list before its December 2017 acquisition by JPMorgan Chase & Co., and has earned recognition on San Francisco and Silicon Valley \"Best Places to Work\" lists for an open, supportive culture that focuses on delighting customers and employees and offers all the usual perks (free lunch daily, subsidized gym membership, Responsible Time Off, etc.).\n Check out our engineering blog:  wecode.wepay.com ( http://wecode.wepay.com/ )\n \nYou can find more information at wepay.com ( http://wepay.com/ ).\n \nTo all recruitment agencies, WePay does not accept agency resumes. Please do not forward resumes to our jobs alias, WePay employees or any other company location. WePay is not responsible for any fees related to unsolicited resumes"},
{"job_desc": " Farmwise is looking for a robotics software engineer to build upon, improve, and maintain our existing ROS ecosystem. As a key member of the software development team, you will have the opportunity to: participate in all phases of software development including concept, design, prototyping, and production, integrate actuators and sensors, including writing drivers, debugging hardware issues, validating system performance, and developing hardware diagnostic tests, integrate and test software solutions in a simulation environment and on the robots, take part in the development of a simulation environment for our robotic system, collaborate with a team of top AI and mechanical engineers to deliver scalable solutions that have a real impact. We get excited about self-starter and hard-working candidates who have: a BS or MS in Robotics, Computer Science, Electrical Engineering, Computer Engineering or related fields, 3+ years of practical experience in writing robust, production-ready, clearly-written, reusable, and well-tested code, a working knowledge of standard software engineering practices for full software development life cycle, including coding standards, code reviews, version control (Git), build processes, and testing, hands-on experience with software development and testing on robots, a thorough understanding of ROS, proficiency in Python and C++, experience working with and debugging physical hardware, actuators, and sensors such as cameras, LIDARs, SONARs, IMUs and GPS, a strong background in object-oriented programming and system architecture, fluency with Linux development environments, experience implementing one or more of the following types of systems/algorithms: planning, simulators, control, calibration, navigation, or localization, experience with real-time operating systems, interrupts, and schedulers, experience with embedded systems (microcontrollers mostly, PLCs would be a plus). Type d'emploi : Temps plein Salaire : $100 000,00 à $150 000,00 /an Expérience exigée : Robotics Software Engineering : 3 ans"},
{"job_desc": " Mountain View,California,United States 6J7BP1\n Primary Responsibilities:\n Assists with the documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems.\n Develops and maintains code and integrates software components into a fully functional software system.\n Assists with test procedures and documenting test results to ensure software system requirements are met.\n Gathers information to support software project management. \nDocuments deployed processes and tools and collect metrics.\n Supports software research and development projects.\n Troubleshoots basic software issues.\n Works under close supervision.\n Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world. \nBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world. \nC++,\n Java,\n Phyton,\n Matlab.\n Any experience industry developing real-time applications a plus. \nDegree and typical experience in engineering classification: Bachelor's or a Master's degree with experience. \nYes, 10 % of the Time Autonomous Systems Individual Contributor No No Standard United States; The Boeing Company"},
{"job_desc": " Company We believe the fundamental nature of work is changing from fixed to fluid, as AI and collaborative technology transform how people and companies work in the next economy. We’re leading this shift with an enterprise platform that changes the way companies think about customer support. Our Crowd-Powered AI platform combines machine learning and gig work to transform and scale customer service for world-class companies like Airbnb, Autodesk, LinkedIn, Microsoft, Pinterest, Samsung and SAP. We’re based in San Francisco and backed by top venture firms and angels from Silicon Valley. Role We have an opportunity for a versatile software engineer to join our agile product development team. In this new position you will be creating core features to expand our relationship with a key customers, Airbnb. You'll be working side by side with Airbnb’s product and engineering teams, sometimes at Airbnb’s offices. This is an excellent opportunity for someone who is excited by being involved in all aspects of software development, from user input to release. About this role You’ll participate in all aspects of an iterative software development process. You’ll work collaboratively with other team members (our company and the customer) to define, build, and test next-generation web and mobile applications You’ll partner with all functional groups to ensure that the software delivered is high quality and easy to manage in a production environment. You’ll participate in technical design decisions and author technical specifications. You’ll develop large portions of the code base, including automated unit and functional tests. About you You have been building scalable, high-traffic web and/or mobile applications for 4+ years. You enjoy working with customers. You have expert knowledge of web technologies like JavaScript, HTML, CSS, and AJAX. You have experience with modern web UI frameworks, bonus for React. You have experience working with Web Services and APIs. Bonus for REST/JSON. You are a strong proponent of Agile methodologies. Bonus for experience with Scrum. You are able to work closely and collaboratively with other strong, intelligent technologists. You have a BS/MS in Computer Science or related field, or equivalent experience. We're an equal opportunity employer. We believe in diversity and inclusion as a strength. This is an exempt, full-time salaried position with comprehensive benefits. Job Type: Full-time"},
{"job_desc": " Job Summary As an early member of the development team, you will have a strong influence on our technology direction. You will work on the full stack, back-end to front-end to Mobile, to create dynamically driven applications. You will work on new product development in Fintech space, as well as re-architecting the platform to support exponential business growth. Responsibilities will include (but are not limited to): working with PM on requirements, technical design, writing top-quality code, testing, code review fellow engineers’ programs, devops, and technical support to internal and external customers. RiverPay is a Toronto based fintech startup focusing on the mobile payments sector. The company is opening its R&D center in Silicon Valley. Our proprietary payment solutions are used by leading retail businesses across North America to tap into the fast-growing Chinese shopper demographic. Responsibilities and Duties Design, code and maintain software libraries that process transactions for millions of users. Produce code that provides access to data, job scheduling, business logic and reporting. Own significant portions of the codebase and monitor its performance in the production environment. Collaborate with other engineers and the Product Team to define clear software deliverables and establish milestones for projects. Integrate your code with third-party APIs. Identify opportunities to improve software infrastructure and security. Research technologies and generate proof of concepts for review. Share responsibilities of keeping production systems stable and scaling. Qualifications and Skills Bachelor's Degree in Computer Science or something related. 3+ years hands-on experience building highly-scalable, secure, robust web applications and/or mobile optimized sites 3+ years of expert knowledge of PHP and the rest of the LAMP stack 3+ years of using relational databases such as MySQL Experience in database design and administration Experience in AWS or other cloud hosting environment and tools Solid experience working with HTML, CSS, XML, Javascript, JQuery Must be able to take initiative, work independently and be innovative Demonstrated ability to meet project timelines and collaborate in a small team Job Type: Full-time Required education: Bachelor's Required language: Madarin"},
{"job_desc": ""},
{"job_desc": " About Haven\n \nHaven is the SaaS-based technology company that thoughtfully advances global trade.\n \nGlobal trade has grown beyond human scale. Increasingly complex routes and higher stakes demand more efficient systems. Haven believes open collaboration and access to information are key to enabling faster, smarter, and more reliable freight shipping. That’s why we build powerful technologies to foster improved communication between companies, decrease trade roadblocks, and mitigate the inherent risks in global trade. Haven is built for companies that ship large volumes of cargo in need of a powerful, easy-to-use tool that allows them to negotiate, ship, and track across thousands of providers and destinations through a single unified platform.\n \nSoftware Engineer\n \nAs a full-stack senior software engineer at Haven you’ll flex your superior engineering skills and impressive architectural acumen to transform global trade. You’ll join a team of crazy smart engineers to remake the industry that moves 90% of all physical goods in the world. Day to day you’ll be a coder working on our platform using the StrongLoop/LoopBack application framework built on top of NodeJS and Express, with an AngularJS UI . You’ll embrace our lean approach towards product and development and jump aboard the MVP, test, iterate weekly or multiple times per week dev/release cycle.\n \nAbout You\n \n \n Skilled Node.js and Angular Developer \n Product minded \n Smart, efficient coder \n Strong software design & architectural skills \n Entrepreneurial thinker \n Experience with agile, scrum, lean development \n Amazon AWS experience a plus! \n Strong Unix Skills (Have you compiled the kernel? points++) \n Basic to Intermediate DevOps knowledge (calculate the netmask of a /27? Awesome!) \n A friend to the product managers & designers of the world \n \nBenefits\n \n \n Yearly Travel Bonus \n Unlimited vacation policy; work hard and take time when you need \n \n"},
{"job_desc": " -----------\n The Problem\n -----------\n \n At its core, education has a fundamental data problem:  schools run on legacy infrastructure that's impossible for developers to build on top of. We're on a mission to replace the terrible things that engineers have to do to build classroom software (think nightly CSV FTP transfers) with an API that feels more like Facebook's or Stripe's. On the school-facing side, we're looking to become a single place where schools can identify, integrate and evaluate the dozens of in-class applications they're using.\n \nWhen we started five years ago, four schools used Clever. Today, Clever is used by over 60,000 schools, making it the fastest-growing company in education. We're looking for talented engineers who want to help us build Clever into something every school, student, and teacher relies on.\n \n-----------------\n A Day in the Life\n -----------------\n \nInterested in APIs, education, data, and scaling a system that supports over half of all the K-12 schools in the U.S.? As an engineer at Clever you will join a tight-knit team working on challenging problems that span the entire stack—from high-performance back-end services to rich front-end web apps. Clever is built with a variety of tools—part of our engineering philosophy is to \"use the right tool for the job\":\n \n \n Node (ES6) \n Go \n Docker \n MongoDB \n Gearman \n AWS (EC2, VPC, S3, R53) \n React \n \n------------\n Requirements\n ------------\n \n \n Strong fundamentals in computer science and software engineering \n A desire to grow as an engineer through collaboration, code reviews, and learning new languages/technologies \n Strong communication skills \n A desire to work in a diverse, highly collaborative team environment \n Experience with any of the tools we use is a plus \n \n------------------\n What Clever offers\n ------------------\n \n \n A chance to revolutionize the way schools use technology. \n Competitive salary and significant equity in well-funded, high-growth company. \n Catered lunch daily. \n Generous vacation and holidays. \n Top-notch healthcare, vision, & dental coverage. \n Unlimited Amazon.com credits for learning. \n An incredible team of fun, bright coworkers. \n \n"},
{"job_desc": " About Haus\n ----------------\n \nHaus helps homeowners sell their home on their own by providing them with the information to navigate the process, access to real estate experts and a transaction platform on which to conduct the sale.\n \nWe Are\n ------\n \n \n Small. We’re a well funded early stage (~7 employees) startup tackling a giant market ($100B+). We’re supported by the startup studio Expa, which complements our operational needs. \n Ambitious. Real estate is ripe for technology. It’s confusing, frustrating, and complicated. We’re making it easier by injecting it with transparency, technology and long-waited satisfaction.. \n Thoughtful. Our core values are transparency and rationality: we’re moving fast, but we’re investing our time wisely. \n Grounded. We’re building a business, which means making sure we deliver value for our customers fast. Monetization is not an afterthought, and we don’t depend on network effects for our product to work. \n \nJob Summary\n -----------\n \nYou’ll be part of Haus Engineering, building the technology to fulfill our vision. Today, we focus on building the Haus transaction platform, a React single page application that is powered by our GraphQL backend. We’re building our infrastructure on Docker containers to allow fast iteration today, and make massive scaling possible in the future. We are a small team without the burden of the infamous legacy application, and can afford to invest in newer technologies as long as they help us move fast.\n \nA good team consists of individuals with different strengths, and we cannot wait to hear about yours. However, to provide coverage for the full stack of technology that powers Haus, you’ll need to be comfortable operating outside of that comfort zone. You should be comfortable jumping in at any point in the stack, not necessarily because you know every technology we’re currently using, but definitely using your experience as a guide. We’re also actively learning from our initial product release so you’ll be helping us to learn from our users and iterate.\n \nOpportunities\n -------------\n \nThese are early days in our company, so there are many opportunities to grow personally and shape the direction.\n \n \n There are plenty of chances to explore new technologies and services since we’re just getting off the ground \n Product input is welcome from anyone in the company, so if you’re interested in contributing to those discussions, we’d love to hear from you \n The company’s culture is important to us and early employees have an opportunity to make an impact on how we grow into a strong, inclusive, and supportive place to work \n \nResponsibilities\n ----------------\n \n \n Build and deliver product iterations to create value for our customers \n Technically scope the product, choosing the systems, estimating complexity and delivering updates on progress to the rest of the team (engineering, product and beyond) \n Perform thoughtful and constructive code reviews which improve the quality of the product and the team \n Go on-call, during which you may be called upon to diagnose and fix operational or software issues \n Collaborate with designers to bring beautiful products to our customers \n \nRequirements\n ------------\n \n \n Five+ years writing code for a production application \n Comfortable with the full web stack \n Significant experience working with a variety of languages, frameworks and datastores, to not only get things done, but to pick the right tools for the job \n Experience deploying software \n Experience mentoring software engineers \n Understanding of test principles \n Passion for Haus’s mission to help people move forward by making home selling simpler for consumers \n Belief in a diverse and inclusive workforce \n \nNon-requirements\n ----------------\n \n None of the following are required for this position: \n \n Identification with a particular gender, race, or national origin \n Having worked with anyone on the team before \n A particular age \n Sharing the same hobbies or beliefs as the other members of the team \n A specific number of years having written in a specific language or framework \n A certain level of activity on a Github account \n A minimum reputation level on StackOverflow \n \nBenefits\n --------\n \nWe are excited to offer a full-time role with awesome comprehensive medical, dental, and vision insurance. We offer pre-tax flexible spending accounts for both health and transportation, a 401(k) plan and a competitive parental leave policy. We also have fantastic office space close conveniently located, spectacular views and your choice of computer."},
{"job_desc": " As a software engineer on the Storage & Caching team you'll be responsible for building and owning the systems that store and serve all of Pinterest’s core data, including users, pins, boards and feeds. The mission of the team is to build systems that are not only highly scalable, performant and reliable, but also a delight to use. Our systems enable our product engineers to move fast and build awesome features rapidly on top of them.\n \n What you’ll do: \n \n Build, own and improve innovative storage services like UMegaStore (key-value storage-as-a-service) and Zen (graph storage service) that serve almost all of Pinterest’s user facing storage needs \n Contribute to open source databases like MySQL, HBase and RocksDB \n Own, improve and contribute to caching systems like Memcached and Redis, and related infrastructure like cache proxies (McRouter) to manage distributed caching at scale \n Continually improve operability, scalability, efficiency, performance and reliability of our storage and caching solutions \n \n What we’re looking for: \n \n Deep expertise on online storage and caching systems at consumer Internet scale, knowledge with HBase a plus \n Strong ability to work cross functionally with product teams and with the storage SRE / DBA team \n Fluent in Java, C/C++ and/or Python \n \n"},
{"job_desc": " We’re creating a revolution in wearable technology with Motiv Ring. A solution so discreet and comfortable you can forget you’re wearing it, so durable you’ll never need to take it off and so well designed you won’t want to.\n \n--------------\n Our Team + You\n --------------\n \nOur experienced team’s background runs deep in design, technology, and science. We have created everything from products you already use every day to advancements that have taken us far into the reaches of space. Your hard work will be deeply valued and you have the opportunity to see your innovations impact and evolve our product into a market leading wearable technology.\n \nWe offer a competitive compensation package with meaningful equity and health benefits. Join our quickly growing team of amazing people and enjoy your days at our casual and creative SOMA office.\n \n-------------------\n What you will bring\n -------------------\n \nYou are a full-stack web engineer who loves building beautiful, performant web applications. You enjoy building front-ends and are comfortable diving into the backend when needed. You thrive on collaboration: you’re comfortable working cross-functionally in a diverse team of engineers, designers, and marketers. You are comfortable reading source code to help you debug issues in various frameworks.\n \n-------------------\n Where you have been\n -------------------\n \n \n 2+ years of software engineering experience \n 2+ years of experience working with single page applications \n Mastery of at least one modern web language: Node.js, Ruby, JavaScript, GoLang, Java, Python \n Good working knowledge of HTTP, web servers, caching, CDNs, CSS, JavaScript, and HTML \n Deep knowledge of object-oriented and functional programming \n Strong interpersonal skills, written and verbal communication \n Strong problem solving, critical thinking, and testing skills \n \n-----------------\n You may also have\n -----------------\n \n \n A Bachelor’s degree in computer science or related field/experience \n Experience with MySQL and related ORMs \n Deep knowledge of Angular or React.js \n Contributed to open source libraries or written some on your own \n \n"},
{"job_desc": " Frederick is a complete marketing platform built specifically to help small businesses succeed. In 2015, we joined Booker, a larger, well-funded startup, and we haven't looked back since.Frederick is now used by thousands of local businesses, including spas, salons, yoga studios, and auto shops to communicate with their customers via email and text. We're rapidly scaling as well as expanding our product to serve new types of customers, so we're growing our team to meet that challenge.As an engineer at Frederick, you'll have a large amount of ownership across the entire software delivery process. You'll play a key role in inventing our next generation platform as well as implementing customer-facing product features.\n \nSoftware Engineer (Full Stack) - Frederick Platform\n \nAs a member of the engineering team, you'll have the opportunity to collaborate with other engineers, product managers, and designers to solve a variety of engineering challenges.\n \n \n You'll work on a distributed platform with a growing set of microservices, using modern technologies and architectural patterns. \n You'll be able to deploy to production daily (or more), thanks to great test coverage and automation \n You'll help your team decide what technologies to use and how to architect new solutions. Every engineer is able to propose better ways to do things. \n \n Qualifications: \n \n You should have a minimum of 1 year full-time professional experience on a software development team. You should have experience with Ruby on Rails and / or React. \n You are familiar with popular testing frameworks such as RSpec, Jest, and Capybara / Selenium \n You enjoy working in a small team environment \n You enjoy working on both front end and back end solutions. Frederick is a full-stack engineering team. \n \n Bonus points for: \n \n Experience building and consuming APIs in an SOA / microservices architecture \n Expertise building complicated apps using Webpack, React, and Redux \n \n"},
{"job_desc": " Smartbiz Loans, a fast growing privately held FinTech company located in SF, is looking for full stack engineers who will create applications streamlining small business loans. \n You will be working in technologies that include Ruby, React, GraphQL, and ES6+, all deployed to AWS. \n The team is growing fast and we need smart people with a passion for helping small businesses grow. \n Required Skills and Experience \n BS in Computer Science, or equivalent \n 2 to 8 years of full stack web development experience \n A fast, passionate learner \n Desired Skills and Experience \n Ruby on Rails, React, MySQL, and AWS knowledge. \n FinTech experience, especially in the lending space \n Experience working in small agile teams with short sprints"},
{"job_desc": " Job Description \n \nAs an engineer on the Customer Engagement team you will... \nWork closely with product managers, designers, and internal teams to understand user needs \nUse your passion for great user experience to develop meaningful, delightful merchant and customer facing features that help our merchants connect with, engage and reward their customers \nWrite concise, well-organized code and sensible tests \nBe given opportunities to stretch yourself by learning new technologies and take on bigger responsibilities than ever before  Qualifications \n \nYou have... \n3+ years of experience developing production software, including 2 years of front-end application development \nThe ability to write JavaScript, both in its raw form and with common JS libraries (jQuery, Underscore, etc.) \nFamiliarity with popular JS-app frameworks (Ember, React, Vue.js, Angular, etc.) \nExperience in testing your code (QUnit, Mocha, Jasmine, etc.) \nKnow how to tease out the right HTML and CSS (or Sass) for a given design \nA strong sense of customer empathy and desire to influence the product direction \nA deep desire to be challenged and continuously improve as an engineer and leader \nA Computer Science or other technical degree \nBonus points if... \nYou have experience with or a desire to learn iOS or Android, Java, Golang or Ruby on Rails. \nYou have experience or interest in learning A/B test design, growth, analytics, machine learning, systems \nTechnologies we use at Square: \nEmber.js, ES6, Sass \nJava, Golang, Ruby / Rails, Protocol Buffers \nAdditional Information \n \n At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance."},
{"job_desc": " As a Senior Full Stack Engineer at our company, you'll be responsible for: Playing a major role in architecting frontend / backend frameworks Developing major application features for the platform Helping to keep the codebase maintainable, extensible and well tested Implementing standards and practices to improve and maintain code quality Working with designers and other team members to understand our users and help guide product decisions Taking ownership of a major part of the codebase and shipping code constantly! What we're looking for from you: A smart and driven developer that is motivated to build a great codebase Great communication skills and a desire to collaborate with the team Deep experience with building web applications Experience and understanding of some part of the tech stack (Python, Django, Javascript, AngularJS, React, Google App Engine, SCSS, and more) Technical degree (though brilliant dropouts are welcome!) Attention to detail and a good general sense of design Understanding of software design patterns and practices At least 3 years of relevant work experience Bonus points if you: Have previous experience working at startup Have experience with enterprise software, marketing and advertising tech, e-commerce products, or photo and video content creation Can contribute towards UI/UX and product design About Us: we  solve the massive problem that faces every consumer business of how to produce, track and optimize branded content across the web. The platform makes the process of collaborating with photographers, models and other creatives more seamless and scalable than ever before while also providing the infrastructure to constantly learn and target the right content for the right person through the right channel. Founded in 2014, we are a fast growing Series A funded startup backed by investors in Domo, Marketo, Dropbox, Google, and Uber. Job Type: Full-time Salary: $120,000.00 to $200,000.00 /year"},
{"job_desc": " Right now, we are seeking a  Junior Java Software Engineer , based at Western Union’s Digital headquarters in San Francisco, California. As a Junior Developer, you will be responsible for implementation of a service delivery model supporting assigned platforms through a predefined frame-work. This includes the Western Union payment pricing engine, operation support, and transaction settlement processing. \n Sound interesting? Here are some specifics: \n Develop and implement new software, maintain and improve existing software \nEnsure that software functionality is implemented with a with a focus on code optimization and organization \nRecommend improvements to existing software programs \nTroubleshoot application issues and coordinate issue resolution with operations, functional, and technical teams \nWork with a software development team and Service providers in a geographically distributed structure \nProvide coaching to Junior Associates \nWorks independently on simple to medium complex projects \n What you will need to succeed: \n B.E. / B.Tech. / MCA in Computer Science, Engineering or related field is preferred \nUp to 4 years of software development experience \nFinancial transaction systems experience is a plus \nRock solid foundation in core Java /J2EE skills \nStrong in developing applications using Hibernate and Spring Frameworks \nMust be a problem solver with demonstrated experience in solving difficult technology challenges, with a can-do attitude \nExperience in developing and implementing web based solutions\n Knowledge of architecture design concepts, object oriented design and techniques\n Knowledge of logical and physical database architectures and operating systems \nExtensive experience in designing and developing REST and SOAP APIs \nExperience with developing APIs (Rest & SOAP based) & creating API documentation \nExperience developing web applications (Spring, RESTful, Jersey, RestEasy,JAX-WS, Web Services) \nKnowledge in Integration/Orchestration (Apache Camel, Jboss Fuse or ActiveMQ) or any other ESB & Caching is a plus \nExperienced working with vendors, managers, and users in the development of robust technical solutions based upon business requirements and objectives \nExperienced software development disciplines-including business modeling, requirements management, component-based development, data engineering, configuration and change management, and testing-into a consistent framework covering the full lifecycle \nExcellent communication and interpersonal skills \nExcellent time-management and task-management skills \nExperience in Agile and Iterative development methodologies \nStrong communication skills with ability to interact with partners globally \nAbility to be flexible"},
{"job_desc": " Job Description \n \nThe Reconciliation Team oversees all money movement at Square, ensuring that our merchants, as well as external financial institutions, correctly settle with Square on every single transaction. We empower Accounting, Finance, Analytics, Payments, and product teams by delivering accurate data that not only are crucial to Square’s financials but also have proven to serve as early warning indicators for many product systems at Square. \nAs a software engineer on the Reconciliation team, you will be responsible for\n designing, building, and maintaining vital services that power the Reconciliation infrastructure which processes every transaction at Square and ensures accurate settlement and payout. You will leverage the most recent advancements in cloud computing technology to design and implement next generation reconciliation systems that will power Square’s growth for years to come.  Qualifications \n \nYou will: \nBuild truly innovative reconciliation systems to ensure Square’s financial credibility \nLeveraging proper cloud computing technology, design and implement highly scalable systems that reconciles every payment from all Square internal products and external partners \nBuild systems that hold Square to the highest standards for financials and compliance \nWork cross-functionally with our card processing, settlement, analytics, finance, accounting, and product teams to develop Square’s reconciliation infrastructure and ensure money movement accuracy \nDevelop a comprehensive understanding of Square’s systems and products. Design and implement systems that feed reconciliation data back to product systems for early-detecting issues and protecting our merchants as well as Square’s financial interests \nYou have: \nMaster degree in computer science or equivalent practical experience \nPassion in pursuing data quality, integrity, and consistency. Desire to be responsible for reconciling all money movements at Square \nUnderstanding and curiosity in highly scalable, stream processing systems \nExperience in cloud computing technology, platform, data pipeline \nExperience in developing backend infrastructure and/or open source projects \nAbility to clearly communicate designs to technical and business audiences \nTechnologies we use: \nJava, Ruby, Rails \nMySQL, HBase \nJSON, Protocol Buffers \nGuice, Guava \nAWS, GCP \nAdditional Information \n \n At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance."},
{"job_desc": " About Weddington Way\n Weddington Way pioneered a community-centric shopping experience that lets friends shop together online in a virtual showroom. Based in San Francisco, CA, Weddington Way offers millennials a new way to shop for weddings, featuring an exclusive collection of fresh + modern bridesmaid dresses. Weddington Way designs and manufactures their own dresses - meaning no middle-men, no markups, and styles crafted with detail and intention that you can’t find anywhere else. With its technology-first approach, Weddington Way is a breath of fresh air in the wedding planning process.\n \nIn 2016, Weddington Way was acquired by Gap Inc. and continues to run as an autonomous brand under the leadership of founder Ilana Stern.\n \n Weddington Way’s team + culture: \nOur employees are our most valuable asset. We respect and listen to each other. We prioritize celebration and community. We believe in work/life balance, but we like when you bring your life to work. Seriously, we love meeting your dogs, cats, babies, husbands, girlfriends, moms, etc.\n \nOur team is made up of dynamic, intelligent, best in class individuals. Our employees come from a variety of backgrounds and industries, and bring with them a unique perspective, which we are excited to listen to. We believe that our brand is only as good as the people behind it, and that we are stronger as team than as individuals. We believe in collaboration. We are equal parts hard work and heart.\n Weddington Way, Full-Stack Software Engineer\n \nWe are looking for well-rounded full-stack software engineer to collaborate with product and UX designers to apply cutting-edge web tech to solve real customer pain points on our nimble team. You should always proactively look for ways to make Weddington Way better and love working in teams to build things people use. Our technology stack (Ruby on Rails, Javascript, React) is on AWS, and your strong foundation in OO and MVC design patterns will be called upon to sustain both high velocity and platform integrity. Experience in high volume online retail will give you a head start, and expertise in client side frameworks, responsive design, iOS/Android, or machine learning will help expand our skill set. You will help implement new features and optimize existing ones across our technology stack. If you thrive in a dynamic and fast-paced environment in a company undergoing rapid growth and scaling, this opportunity could be a great fit for you.\n \nWe’re passionate about applying thoughtful technology to transform a traditionally stressful and unsatisfying shopping experience into a convenient and delightful one. Everyone in the company operates with the customer in mind first – we start with the customer and work backwards in everything we do. This role will report to the Head of Product and Operations.\n \n Capabilities and Requirements: \n \n Strong foundation in algorithms, data structures and design patterns \n Solid understanding of the full web technology stack \n Expert proficiency in at least one typed and one dynamic programming language \n Experience with web infrastructure and distributed systems \n Experience with software engineering best practices and a disciplined approach to testing and quality assurance \n B.S. or higher in Computer Science or equivalent work experience \n Prior experience working for a consumer internet company is highly desired \n Javascript, CSS, jQuery, Full-Stack Web Development, Ruby on Rails \n \n Your impact: \n \n Help set the direction of our company and product \n Freedom to take initiative to shape the design and structure of our platform \n Meaningfully (and measurably) improve customer experience (thanks to first-hand feedback from customers and customer-facing teams) \n Measurably impact the business trajectory through close collaboration with business owners \n Help revolutionize the way consumers shop through a more personal and seamless experience, giving them time back to focus on the things that matter most \n \n Your collaborators: \n Sankara, Engineering:  “I would love to work with someone who will be a thought partner as we work to find creative solutions to scale our platform so we can maintain our customer experience as we undergo high growth.”\n \n Tammy, Engineering:  “I would love to work with someone who has humility, enjoys collaboration, and is focused on making a delightful user experience for our customer.”\n \n Karishma, Product:  “I’m excited to work with someone who has a desire to get to know our customer and take ownership of the technology solutions we build for them.”\n \n Ilana, Founder:  “I am eager to work with someone who is passionate about learning and growing while meaningfully impacting our customer experience.”"},
{"job_desc": " Hi! Thanks for your interest in Brave.\n \n \nThe Full Stack Engineer works on the Basic Attention Token's publisher facing website:\n \nhttps://publishers.basicattentiontoken.org/\n \nBrave is based in San Francisco. This role is Remote OK!\n \n \nBAT is a utility token serving as a unit of account between advertisers, publishers and users,\n \nand you can learn more about it here: https://basicattentiontoken.org\n \n \nThe BAT Publishers website is the primary interface for publishers, and it's an essential part of the BAT system.\n \nAs the BAT Publishers Full Stack Engineer you would work on all aspects of Publishers.\n \nYou would primarily work with the BAT Publishers Technical Lead, and also work with the rest of the BAT Cloud team.\n \n \nRelevant skills and topics:\n \n- Ruby on Rails (or experience in 2+ programming languages)\n \n- Data models\n \n- APIs\n \n- OAuth\n \n- JavaScript\n \n- CSS (SASS), Bootstrap\n \n- Security\n \n- Strong opinions, weakly held\n \n- Self starter\n \n- Contributor to open source software\n \n- Liker of a free Internet\n \n \nAll Publishers work is free open source software and you can see our work at https://github.com/brave-intl/publishers\n \n \nBAT has exciting things in store this year, and we'd love your help.\n \nIf this all sounds exciting, please reach out. Thank you!\n \n \nAyumi Yu\n \nTechnical Lead, BAT Publishers"},
{"job_desc": " Virta is the first company with a clinically-proven treatment to safely and sustainably reverse type 2 diabetes and other chronic metabolic diseases without the use of medications or surgery. Our innovations in nutritional biochemistry, data science and digital tools combined with our clinical expertise are shifting the diabetes treatment paradigm from management to reversal. Our mission - to reverse type 2 diabetes in 100 million people by 2025.\n \nAs a Full Stack Engineer you will contribute to our patient-facing applications and clinical workflow tools. You will need to be adaptive, demonstrating an ability to shift your focus across all levels of our stack to meet the rapidly changing needs of a growing company. You will have the opportunity to take ownership of new and critical features central to the success of both our patients and mission.\n \n Requirements: \n \n 2+ years shipping back-end and front-end code in high-quality production environments \n Solid knowledge of at least one server-side language (Python preferred; Ruby, PHP, go also considered), HTML, CSS, and JavaScript \n Experience with SQL data stores (we use PostgreSQL; MySQL experience works, too!) \n Has attention to detail, carefully crafts both tests and code \n Loves learning new technologies \n \n Bonus Points For: \n \n Experience using Docker \n Experience with React \n Experience with no-SQL data stores (Redis, document-based stores, message queues) \n Significant experience in the Python ecosystem, e.g. Flask, background job scheduling with Celery, Flower, etc \n Experience building and deploying microservices \n \n Responsibilities: \n \n Code and ship complex new features in our web apps at high velocity and high quality with well-structured code \n Troubleshoot, debug, and fix issues in production and non-production environments \n Coach and mentor fellow engineers, and recommend best practices and tools \n \nWithin your first 90 days at Virta, we expect you will do the following:\n \n \n Code and ship at least one complex feature that involves both front- and back-end code with full test coverage \n Teach and inspire other engineering team members through knowledge sharing, pair programming, and/or giving feedback in code reviews \n Propose and implement one or more process improvements to make our engineering team even better \n \nVirta’s company values drive our culture, so you’ll do well if:\n \n \n You put people first and take care of yourself, your peers, and our patients equally \n You have a strong sense of ownership and take initiative while empowering others to do the same \n You prioritize positive impact over busy work \n You have no ego and understand that everyone has something to bring to the table regardless of experience \n You appreciate transparency and promote trust and empowerment through open access of information \n You are evidence-based and prioritize data and science over seniority or dogma \n You take risks and rapidly iterate \n \n"},
{"job_desc": " Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n Join iCloud's CloudKit server engineering team to work on iCloud Photo Library and iCloud Photo Sharing. iCloud Photo Library stores every photo and video you take, and keeps them up to date on all your devices. Any edits you make are automatically updated everywhere. iCloud Photo Sharing makes it easy to share photos and videos with exactly the people you want to see them.\n Key Qualifications\n 5 or more years software engineering experience and responsibilities\n Solid experience in Java on high-throughput applications\n Experience designing, implementing and supporting scalable distributed systems\n Ability to give and receive technical feedback in code and design reviews\n Ability to thrive in a cross-functional team on high profile, critical projects\n Excellent analytical and problem solving skills\n Excellent written and verbal communication skills\n Description\n The CloudKit server team is looking for a software engineer with a passion for building large-scale Internet applications that can keep up with the demands of hundreds of millions of users. You should have demonstrable experience building high-performing systems that are scalable and extensible.\n \n Interest in some or all of the following is a bonus: \nScripting languages such as Python\n Distributed database systems\n iOS and OS X application development\n Security and encryption\n Digital photography\n Education\n Bachelor's or Master's degree in Computer Science or equivalent industry experience\n \nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."},
{"job_desc": " Job Description \n \nPayments is Square’s core product and the foundation for the growth of many other Square products. Millions of merchants use the payments product for their business every day. The Payment Product team focuses on improving the end-to-end user experience for these merchants and on building new user-facing tools to help them better manage the payment aspect of their business. A few examples of the products that we work on: \nIn-app Terminal, which is the payments experience in the Square POS app, often with a reader.\n Virtual Terminal, which provides a way for merchants to take payments in a browser without a reader.\n Card on File, which allows merchants to store buyers’ cards for future payments.\n Instant Deposits, which enables merchants to immediately deposit their credit card sales in their bank for a fee.\n Onboarding and new user experience for payment products.\n Transaction and deposit reporting.\n Referral program.\n We are a full-stack product team: we improve and integrate with the money moving platform and deliver product features on web, as well as in our iOS and Android apps. Our approach is both customer-focused and data-driven: we talk to existing and prospective merchants, understand their needs and pains, and find opportunities to improve product experiences from data insights and A/B tests. As a Software Engineer:\n You will: \nCreate and optimize the core payment product experiences using Ruby on Rails, Ember.js, Java, and MySQL \nDesign, implement, and analyze A/B tests \nBuild extensive, reliable support for product data logging and metrics \nWork closely with our product, engineering, analytics, and marketing teams  Qualifications \n \nYou have: \nBA/BS degree or equivalent practical, working experience (4+ years preferred) \nBeen self-driven, open to collaboration and willing to grow as an engineer \nA strong sense of customer empathy and desire to influence the product direction \nCuriosity in numbers and metrics with a focus on measurable impact \nEven better if you are experienced in: \nRuby on Rails or Ember.js full-stack development \nA/B test design, analysis or related tools \nCross-team and cross-functional collaboration \niOS/Android development or interested to learn \nTechnologies we use and teach: \nRuby on Rails, Java, Javascript, Ember.js, MySQL, Protobuf \nA/B test techniques and methodologies \niOS or Android development \nAdditional Information \n \n At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance."},
{"job_desc": " Job Description \n \n What you'll do... \n \nAdvance the state of the art in building integration components, APIs and backend functionality with Java, Mulesoft, Node.js, Ruby on Rails. \nDevelopment on an SaaS enterprise platform and application that’s streamlining workflow processes in an important industry. \nWork with other top-notch engineers, PMs and QA in our downtown San Francisco office (right near the Montgomery St. station). \nOperate as a member of the goBalto agile development team.  Qualifications \n \n Skills you have... \nThree or more years experience developing and implementing enterprise-scale reports and dashboards, including: \nMinimum of 3 – 5 years server side development experience. \nExtensive experience technologies like Java, Ruby on Rails, Node.js, queuing systems, app servers. \nPreferred experience with Mulesoft or similar integration infrastructure. \nExtensive experience with data modeling and SQL. \nProven experience with unit testing and test frameworks. \nGit or similar distributed SCM tools. \nStrong interpersonal skills. \nDemonstrable expertise and recent experience with the following is a plus: \nEnterprise SaaS architectures \nService-oriented architectures \nFamiliarity with cloud-based deployments \nQueuing and real-time streaming systems \nTeam attributes... \nNot Just Another Social App—we're building a meaningful product with the potential to speed the delivery of new medicines to market. \nAgile Bones—we promote an agile, test-driven engineering practice that emphasizes team collaboration through pair programming (where appropriate), daily standups, retrospectives, etc. \nTechnology You're Already Passionate About, and Want to Do More With—we're using technologies such as Node.js, Ruby on Rails, Angular.js, Storm, Redis, AWS, Cucumber, Capybara, Rspec, and more to build solid, well-tested, and beautiful web applications, and challenge our engineers to learn and do more with them. \nAdditional Information \n \n This role is not eligible for Visa sponsorship or transfer at this time. \n \nWhat's in it for you… \n \nBecome part of a team that's new, energized, and going places…fast \nGrow and develop right along with goBalto \nEarn a generous compensation package, including benefits from day 1 \nMedical, dental, vision care, commuter checks, FSA, and 401(k) \nReap the fruits of stock options as a reward for your energy, contributions, and dedication \nA PTO plan that starts accruing the moment you start"},
{"job_desc": " GraftWorx is turning the Internet of Things into the Internet of the Body. Are you interested in working at the intersection of advanced medical data analysis and Engineering development? Do you have interest in changing the world of medicine and saving lives by developing and applying state of the art solutions to our Engineering team?\n \nWe're looking for engineers with natural product intuition who can thrive on learning new technologies and build systems that can support our growing and rapidly changing organizational needs. Our challenges are unique, so you should be comfortable working in uncharted territories and excited to build scalable solutions across an entire Engineering stack.\n \n The kinds of skills we're looking for: \n \n You should have advanced knowledge of at least one scripting language such as Python or JavaScript and knowledge of or eagerness to learn MySQL, PostgreSQL, Redis, ElasticSearch. \n You have an intimate knowledge of the whole web stack, the data path along the way, and how all the pieces fit together (front end, database, network layer, etc.). \n You can build scalable robust services that support our growth requirements. \n You should have a strong desire to use your abilities to revolutionize HealthCare using a deep understanding of the the value of data and technology to improve our standard of life. \n You should believe that you can achieve more on a team- you will be collaborating with Product Managers, as well as Firmware and Hardware Engineers. \n \n"},
{"job_desc": " Who are we looking for?\n \nGetFeedback is poised to establish a leadership position in the emerging customer experience (CX) space. We have a killer product, an amazing team, and an enthusiastic customer base -- and ambitious plans to expand all three.\n \nWe’re looking for a proven full-stack software engineer to play a key role in realizing our product vision. As an engineer at GetFeedback, you’ll write awesome, foundational code and help to mature important processes as we aggressively expand the product and grow the engineering team.\n \nWhat does a strong candidate for this role look like?\n \nYou’re a tried-and-true web app developer with a solid command of every part of the modern web app stack. You love building rich interfaces with the latest browser technologies as much as you relish tackling complex challenges server-side, all with the support of a talented team amid a well-architected application environment. Your code is performant, scalable, forward-thinking, well-organized, and thoughtfully written.\n \nYou’re adept at navigating the moving parts involved in turning ideas into working software, including collaborating with designers and product managers, and leading other developers. This also means that you’re able to maintain a clear understanding of broader product and organizational goals, so we can depend on your sense of ownership to identify and drive important decisions and to prioritize effectively.\n \nWhat’s in it for you?\n \n \n An opportunity to work on consumer-front-end, enterprise-grade-back-end SaaS app, used by many of the largest and most exciting companies in the world \n A chance to test and hone your engineering chops as we expand into exciting and challenging new product areas like predictive analytics \n An opportunity to stretch yourself as an engineer and as mentor \n An exciting ride in a fast-growing company \n \nQualifications\n \nGetFeedback is a modern, responsive web app. You should be experienced and comfortable in the following areas:\n \n \n Ember.js or equivalent modern web UI framework \n HTML5 \n CSS3 \n JavaScript \n Ruby on Rails or equivalent web app framework \n PostgreSQL or other major RDBMS \n \n To be most successful, you should have experience in: \n \n Agile development \n Working with other developers through architecture discussions and code reviews \n Test automation \n DevOps and Continuous Delivery \n \nWe look forward to hearing from you!"},
{"job_desc": " At FuelX , we help our clients grow their business through data-driven video advertising.\n Our video prospecting technology leverages real-time data processing and machine learning to bring our clients new customers. We know that dynamic online video advertising, coupled with rich data insights, is the only way to beat the noise of static ads.\n Our team is growing and we’re looking to add smart, empathetic, passionate people who operate on high integrity. We value the energy that every team member brings to us and to our customers, and we're looking for individuals who want to bring their unique contribution to FuelX.\n As a Backend Engineer at FuelX, you have the chance for significant ownership as you build out fundamental microservices for our applications, products and technologies. Providing SDKs and APIs. Responsibilities\n Works on open bidder framework for RTB project.\n Develops ETL and maintain large dataset in variable DB structures.\n Installs server solutions by applying Java tools, building custom designs, developing DBMS, and completing prototypes resolving problems.\n Validates server solution by developing and conducting test scripts.\n Improves server solutions by conducting systems analyses identifying problems evaluating alternative solutions.\n Updates job knowledge by studying upgraded Java development tools and programming techniques participating in educational opportunities reading professional publications Requirements\n Experience in Lucene based search.\n Expertise in Object Oriented analysis and design, in depth understanding of classic design patterns and J2EE patterns.\n Technically capable with maximizing build quality and simplifying the build process through use of build and integration tools (e.g. Ant, Maven, etc.).\n Solid experience in applications with multi threading and garbage collection.\n Proficiency with data warehouse and process (ETL).\n Fundamental knowledge of application DB structure (documentary, relational and Map).\n Foundational experience with cloud computing in AWS, GCE, Azure.\n FuelX is a direct response online video ad platform enabling marketers to go beyond traditional branding with video by driving conversions, leads, and sales. FuelX’s proprietary fingerprinting technology identifies unique user behaviors that tailor to any target audience while solving for cross-device and full-funnel attribution. With FuelX's data-driven results approach to video advertising, marketers will understand what their customer journey looks like from beginning to end while achieving positive campaign ROI.\n At FuelX we value our community and our culture very highly. We are actively looking for team members who align with our vision, mission and values.\n OUR VALUES We strive for excellence in all we do. We care. We are authentic with our clients and with each other. We love to learn. We're curious. We ask questions. This is our obsession in delivering an elegant solution. We step up and bring it...every day. We're givers, not takers. We contribute.\n Come visit our culture code to learn more about us!"},
{"job_desc": " Capella is looking for a software engineer to join our growing flight software team. The team designs and implements features for subsystems and the flight system working both bare metal and within a Real-time Operating System. The ideal candidate has a very strong background in low-level and system development for embedded devices.\n \n Responsibilities and learning opportunities include: \nArchitect, develop, and maintain embedded software systems (systems programming, application development)\n Work with hardware, software, and integration engineering teams to determine requirements and goals for tools under development\n Assist with board bring up and low-level debugging\n \n Requirements: \nPreferred Skills\n \n Independent self-starter, analytical, and problem solving skills \n Experience developing for real time operating systems (RTOS) or Linux \n Experience with linux Kernel \n Solid embedded real-time programming skills in C \n Solid understanding of object-oriented development \n Experience in data structure design and algorithm development \n Strong knowledge of bus protocols such as I2C, SPI, UART and SDIO \n Practical experience in makefile and cmake programming \n Familiar with bash shell programming and scripting languages, Python, Ruby, etc. \n Comfort with tools such as debuggers, logic analyzers and oscilloscopes. \n Experience reading and reviewing schematics \n Experience with automated testing methodology \n Good written and verbal communication skills \n \nRequired Skills\n \n BS or MS in Software Engineering or equivalent major. \n BS + 5 years industry experience, or MS with 2+ years industry experience, preferably in C and embedded system programming. \n Excellent written and verbal communication skills. \n U.S. Citizenship required \n \n Benefits: \nBenefits at Capella are not just about the little perks here and there (although we have many of those too). We are building the most advanced small-satellite in the world by bringing a capability that has never existed before and will change how we interact with it. Besides the opportunity to take part of an innovative project with a highly motivated and skilled team, we also take pride in taking care of our employees.\n \n Here are just a few ways that we show our appreciation: \n \n Gourmet style free lunch \n Happy hour and company dinners \n Medical/dental/vision/life insurance \n 401(k) \n Unlimited vacation hours \n Flexible work schedule \n \n"},
{"job_desc": " The Retail Engineering team at Affirm delivers on key product goals that enable our retail partners to grow their businesses both online and offline. The team executes on revenue generating priorities that strengthens the Affirm offering across our portfolio of merchants and consumers. This is a unique opportunity to gain exposure to skills required to succeed in both B2B and B2C capacities.\n \n \nIn order to succeed in our vision to offer honest financial services that improve lives, our team must maintain extreme efficiency and deliver a seamless experience with every customer interaction. We're looking for experienced, motivated software engineers who will build products and systems that serve our customers, merchant partners, and employees.\n \n \n What You'll Do\n You will lead the development of products for our merchant partners, our customers, or our finance, risk and operations teams\n Collaborate with Product Management, Design, and Platform Engineering to iterate and enhance our product offerings\n Plan, design, communicate, and implement software systems with an eye towards robust, extensible architecture\n Lead technical discussions and plans to improve our overall software quality\n Develop technical specifications and decompose the specification into tasks and phases.\n Estimate project work effort and delivery, and create a project roadmap\n Continuously raise the bar in terms of code quality, performance, and systems design.  What We Look For\n Passionate  : Passionate about Affirm's Mission: \"Deliver Honest Financial Products that improve lives\"\n Technical  : Fluent in full-stack development (we use React/Redux + Python/Flask)\n Collaborative  : Enjoys cross team collaboration especially with product managers and designers\n User Focused  : Cares about the details in the user experience\n ABOUT AFFIRM  \nAt Affirm we are using technology to re-imagine and re-build core parts of financial infrastructure to enable friendlier and more transparent financial products and services that improve lives.\n \n \nWe believe the financial industry is fundamentally broken. Not only is the core infrastructure built with technology from the 1970s, but there are a dwindling number of people who say \"I trust my bank to look out for me\". It doesn’t have to be this way, and it’s our mission to fix this problem.\n \n \nWe are based in San Francisco; founded by Max Levchin (founding CTO of PayPal), Jeff Kaditz (CDO DeNA/ngmoco), and Nathan Gettings (founding CTO of Palantir); and building a team of exceptionally talented people to join us on our mission."},
{"job_desc": " Join us as we pursue our disruptive new vision to make machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun and most importantly to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!\n \n Role: \nGetting a vast variety of massive data ready for analysis is never easy. Splunk is looking for Software Engineers to join our Data Availability team to design and develop the sophisticated products to collect, transform and enrich data in a fast, scale and reliable way both for Cloud and On-premise customers.\n \n Responsibilities: \nWork closely with the product team to design and develop a variety of features, reusable components and products for data availability area.\n Implement the features that use groundbreaking technologies\n Writes high quality production code for a contained complicate feature set or function area\n Analyze and optimize system and codes, and pursue simplicity, efficiency, reliability and performance\n Work with the team and independent judgment to take existing code, understand its function and change/enhance as needed\n Provide technical guidance, and engage in design and code review for other team members\n \n Requirements: \nSolid foundation in computer science, with strong competences in operating systems, networks, data structures, algorithms and software design\n Excellent problem solving, collaboration and communication skills\n A demonstrated capability for creative thinking, intellectual and entrepreneurial exploration\n At least one profound programming skill on C/C++/Java/Go and one of script language on JavaScript/HTML/Python\n \n Nice to have: \nUnderstanding in Kafka, Hadoop/MapReduce, Data Visualization.\n Understanding in one of major Cloud technologies, e.g. AWS, Azure and Google Cloud\n Experience in large system coding, debugging, and performance tuning skills would be plus\n \n Education: \nBS, MS or PhD in Computer Science or related engineering discipline.\n \n What we offer you: \nA constant stream of new things to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.\n A set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.\n Breadth and depth. You want to work on an area that spans backend and frontend and SDKs? We have that.\n Growth and mentorship. We believe in growing engineers through ownership and leadership opportunities. We also believe mentors help both sides of the equation.\n A stable, collaborative and supportive work environment. We work in an open environment, have a shared kitchen and sit down for a quick sync every morning.\n We don't expect people to work 12 hour days. We want you to have a successful time outside of work too. Want to work from home sometimes? No problem. We trust our colleagues to be responsible with their time and dedication, and believe that balance helps cultivate a great environment."},
{"job_desc": " Job Summary Where:   San Francisco, CA Job Type:   Full Time Department:   Engineering Experience:   Mid-level to Senior SKUPOS  is the data hub for the convenience retail industry. Retailers, distributors, and brands all convene on the SKUPOS platform to create value from previously disparate and hard-to-obtain data. We build tools with this data to help each cohort of our industry succeed in their roles. Our software integrates at a retailer’s point-of-sale and automates the previous manual inventory and ordering processes. For distributors and CPG brands, we provide real-time insight into customer inventory and market basket data. SKUPOS  is seeking a full-stack engineer for a thriving development team. We are a tight knit group with a team first mentality. We strive to achieve our product development efforts through our team culture, clean code and hard work! We are looking for a passionate developer that takes pride in their code and work relationships. A developer that wants to improve on their talents and contribute to the growth of the development team. A developer that supports the company’s vision and mission by delivering first-class products together. Responsibilities Build  :   design, code, test, maintain and support features for our... Ruby on Rails application with MySQL, Redis, and various AWS services React Progressive Web Apps Node.js applications Coordinate with team on... Project preparations - assist in developing project plans and proposals Detailed specifications Pair programming Code reviews Track Project progress Ensure timely completion within allotted timelines Actively create transparency R&R  :   Research and Recommend new technologies that will… Enhance team performance Improve project delivery times Decrease development stack overhead Required Skills / Experience 4-year computer science degree or equivalent experience 2+ years of professional work experience with Ruby/Rails or similar Experience with Test-driven development (e.g. RSpec) Unit testing SQL (e.g. PostgreSQL, MySQL) In-memory caching and search indexing MVC Frameworks (Rails, Django, Sinatra) OOP, FP, design patterns, data structures Building REST APIs (GraphQL experience even better) Client side technology (React, ES6, Webpack) Understanding of JS frameworks such as React, Angular, Vue Scaling web applications Build and deployment automation Strong linux command line skills (Ubuntu, FreeBSD, Mac OS X) preferred Desired Skills Start-up experience Open-source experience Knowledge Experience deploying code with Github, Heroku or AWS Other languages a plus: Java, Python, Perl, PHP, C++, C# Cloud and distributed services (AWS, Elasticsearch, Cloudflare) What we offer Competitive salary Major role in a strong, small and growing development team Be a part of a key platform of product offerings to the retail convenience store industry Healthcare benefits Job Type: Full-time Required experience: software: 2 years Job Location: San Francisco, CA 94103"},
{"job_desc": " What you'll do\n We are looking for someone who loves building services for the creative professional and implementing features across the full Web Solution Stack – ours is Linux, Nginx, PHP, Postgres using Docker. You’ll be working as part of a team, creating innovative new features and maintaining existing ones for Adobe Stock (stock.adobe.com) and underlying micro services.\n The perfect candidate will need a keen eye for details and high standards for code quality and efficiency. Knowledge of best practices in building scalable applications is highly desirable. Candidates who enjoy tackling complex technical challenges, have a passion for delighting customers and who are self-motivated to push themselves in a team oriented culture will thrive in our environment.\n What you’ll need to succeed\n Experience developing consumer facing web sites and REST API's built using PHP, JavaScript, HTML and CSS\n Experience with test-driven and behavior-driven development and tools (e.g. PHPUnit, Behat, Jasmine)\n Knowledge of best practices and SOLID design principles in object oriented programming\n Knowledge of security best practices (e.g. SQL injection, XSS and other exploits)\n Strong technical skills, excellent communication and problem-solving skills, and the ability to engage and interact with other teams.\n Excellent trouble shooting skills across layered systems/services\n Solid knowledge of PHP and supporting frameworks (e.g. Zend, Laravel, Lumen).\n BS in Computer Science or a related field\n Bonus:\n Git/Github or other version control systems\n Experience with Docker\n Experience with AWS\n Experience with microservices architecture\n At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists . You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.\n If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\n Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age , sexual orientation, gender identity, disability or veteran status."},
{"job_desc": " OVERVIEW  \nDo you get annoyed by the traditional financial services experience? Are you looking for a breakout moment to define your engineering career? If so, we want to talk to you.\n \n \nThis is an opportunity to join a Series B company with the perfect mix of fresh capital and demonstrated business potential. If you like early stage, we're in that magic sweet spot. We are not a fad. We have a real business, disrupting the antiquated 401(k) market for the SMBs and their employees and becoming the next-generation, financial technology company.\n \n \nWe are looking for a super ambitious, frontend loving, up-and-coming full stack extraordinaire to transform the 401(k) experience for both employers and employees with us!  \n \n RESPONSIBILITIES\n Own the backend and frontend systems underlying the ForUsAll participant experience.\n Oversee design and maintenance of backend database systems.\n Build tools and automation for scaling up internal operations.  REQUIREMENTS\n Full stack engineering extraordinaire.\n Demonstrated ability to deliver a high NPS product in a very fast paced and continuously changing environment.\n BS in Computer Science, Software Engineering or related field. MS or PhD is a plus.\n A rock­-solid foundation in Computer Science fundamentals: data structures, algorithms, software design.\n Ninja-like skills with frontend technologies like HTML, DOM, JS, CSS, React.\n Experience with relational database systems (like PostgreSQL or MySQL). Ability to architect new schemas, as well as maintain and improve performance of existing ones.  Nice to Have\n Experience with Rails. High level of proficiency and in-depth knowledge of Ruby and Rails.\n Experience with popular analytics services like Google Analytics, MixPanel.\n Experience with AWS (EC2, S3, RDS) and deployment tools (like Capistrano, Jenkins, Chef).\n ABOUT FORUSALL  \nWe’re ForUsAll, a San Francisco-based financial technology shop that’s expanding hard-working Americans’ access to 401(k) plans. We’re helping the underserved – and the dreadfully served – get good, honest retirement plans at work. Founded by experts who transformed the 401(k) for Fortune 500 companies, we’re backed by prominent venture capital and financial technology veterans who share our vision of bringing that expertise to small and mid-size companies. By leveraging that expertise, we’ve re-imagined the 401(k) from the ground up, removing much of the administrative workload and compliance risk for employers. For employees, we’ve replaced alienating jargon with plain English, and added a user experience that’s worth, well, experiencing. And, all of this for less than half the typical cost. Our mission is simple, to fix what’s broken about retirement in America, so that everyone has a fair shot at a brighter financial future."},
{"job_desc": " Recognized as a global leader in interactive and digital entertainment, Sony Interactive Entertainment (SIE) is responsible for the PlayStation® brand and family of products and services. PlayStation has delivered innovation to the market since the launch of the original PlayStation in Japan in 1994. The PlayStation family of products and services include PlayStation®4, PlayStation®VR, PlayStation®Vita, PlayStation®3, PlayStation®Store, PlayStation®Plus, PlayStation™Video, PlayStation™Music, PlayStation™Now, PlayStation™Vue, PlayStation®Original and acclaimed PlayStation software titles from SIE Worldwide Studios. Headquartered in San Mateo, California, SIE is a wholly-owned subsidiary of Sony Corporation and has global functions and regional headquarters in California, London and Tokyo.\n \n Responsibilities: \nYou will be responsible to execute full life-cycle software development and write well designed, testable, efficient code. You'll produce specifications and determine operational feasibility, integrate software components into a fully functional data analytics system, develop test plans and quality assurance procedures. Also, you will document and maintain software functionality and tailor and deploy software tools, processes and metrics.\n \n Qualifications: \nCoding experience in Java or C/C++\n \nStrong foundation in computer science with an emphasis in algorithms, data structures, software design\n \nSony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.\n \nWe strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.\n \nWe sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation."},
{"job_desc": " Come be part of the community of talented, forward-thinking engineers who develop Software that connects Twitter services to the world.\n \n \n Who We Are:\n \n \nTwitter responds to hundreds of billions of requests per day, and the Traffic team services support every one of those requests. Our work impacts Twitter worldwide. We build software and services that are fundamental to Twitter’s strategies around growth and revenue. New and exciting efforts are underway that will radically improve latencies and reliability worldwide.\n \n \n What You’ll Do:\n \n \nAs a software developer on our team, you will work with highly talented engineers on one of the world's highest throughput platforms. You will participate in all of our initiatives, having ample opportunities to both learn and teach. You will be expected to lead some efforts while offering support for others. We collaborate to bring out the best in each other. You will make critical decisions, write designs and code that\n \n Improves latency as perceived by our customers\n \n \n Upgrades our security\n \n \n Enhances the reliability of Twitter services\n \n \n The services you create and operate will play a key role in Twitter user satisfaction and growth. You will diagnose, and troubleshoot complex distributed problems and develop solutions that have a significant impact at our massive scale. You will gain expertise in the ideas, software, and micro services for\n \n DDoS mitigation\n \n \n Latency minimization\n \n \n Service Discovery\n \n \n Authentication\n \n \n Rate Limiting\n \n \n Millions of existing customers will immediately benefit from this work, and many more new customers worldwide will follow. Inside Twitter, your work will empower dozens of engineering teams, and hundreds of co-workers. Externally, you will empower people to connect and communicate.\n \n \n Who You Are:\n \n \nYou are passionate about building massively scalable systems. You want to deliver top tier services with impact worldwide. You want to challenge yourself, and to work with a community of the best engineers in the industry. You have a growth mindset and the belief that your skills and abilities can be developed. You have a track record of taking on and delivering solutions to challenging distributed systems problems.\n \n \n Requirements:\n \n 2+ years experience developing and operating large scale distributed systems with high availability\n \n \n 2+ years experience with Java, Scala, and/or C++\n \n \n BS, MS, or PhD in computer science or a related field, or equivalent work experience\n \n \n Experience with some of the following is a plus:\n \n Backend service development\n \n \n Network protocols\n \n \n Performance analysis\n \n \n Proxy Servers\n \n \n Development on the JVM\n \n \n Asynchronous I/O\n \n \n Multi threading\n \n \n Concurrency\n \n \n The Java memory model\n \n \n OAuth\n \n \n Netty\n \n \n Finagle\n \n \n Finatra\n \n \n ZooKeeper\n \n \n We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran status, genetic information, marital status or any other legally protected status.\n \n \nSan Francisco applicants: pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."},
{"job_desc": " Engineering at ThousandEyes\n \nAt ThousandEyes, we use cutting-edge technologies and innovative techniques to study and visualize networks on a global scale.ThousandEyes engineers are focused on continuous improvement -- of our product, our codebase, our knowledge, and our skills. We believe in innovation, simplicity, and elegance. We work in small, cross-functional teams where everyone has a voice.\n \nAbout the Role\n \nAs a Software Engineer focused on our backend systems, you will be contributing to our data collection and processing infrastructure. This includes a set of Java microservices that processes the data collected from our global footprint of agents.\n \n Apply for this role if you: \n \n Are a fast learner \n Are comfortable working with new technologies \n Have excellent software design skills \n Have 2+ years of Java development experience \n Have experience with The Spring ecosystem \n Have experience with streaming architectures, in particular Kafka \n \nSenior roles are available to those who have any of the following:\n \n \n An advanced degree in a relevant area \n Significant work experience with large Java applications or distributed data collection systems \n \nBonus points if you have a deep understanding of network protocols such as TCP/IP, DNS, and BGP, or have worked with any of the other technologies in our stack:\n \n \n MongoDB \n MySQL \n Docker / Kubernetes \n Kafka / Kafka Streams \n \n"},
{"job_desc": " Job Description \n \n The Customer Engagement team’s mission is to help merchants grow their business by giving them tools to know, support, engage, and acquire their customers. Our product suite includes CRM, omni-channel marketing (e.g. email, social, advertising), feedback and messaging, loyalty and rewards. We’re hiring engineers to help build the next generation of our Customer Data Platform which is used by Square and third party developers to build their customer-focused products.  Qualifications \n \nYou Will: \nDesign and build new features that enable merchants to better understand and serve their customers \nDeliver APIs that make it easy for developers to interact with customer data \nDevise solutions to performance and scalability challenges as our customer data set continues to grow \nPlan for the future by clearly communicating the cost-benefit of a given solution and advocating the best path forward \nUnderstand and mitigate risk through robust analysis and testing\n Work closely with product management, design and internal teams to understand needs and develop solutions to improving operations and end-user experience \nVisit merchants to see the product(s) in action \nGive opportunities to stretch yourself by learning new technologies \nYou have: \nKnowledge of CS fundamentals and code organization \nA consistent track record of shipping quality software that positively impacts your end customer \n5+ years of software development experience or equivalent \nA bachelor’s degree in Computer Science or similar experience \nA strong sense of customer empathy and desire to influence the product direction \nCritical thinking, problem solving and analytical skills \nTechnologies we use and teach: \nGo*, Java*, Protocol Buffers*, MySQL*, Ruby / Rails \nEmber.js, ES6, Sass \nAndroid, iOS/Cocoa These technologies you will use daily as a member of the Customers Directory team \nAdditional Information \n \n At Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance."},
{"job_desc": " Unity is looking for a software engineer to join our In-App Purchase (IAP) team. The In-App\n Purchase team is focused on building the next generation of Unity’s Monetization Platform,\n which empowers developers to simply build and ship cross-platform games with best-of-class\n monetization through advertising, in-app purchase, and analytics, backed by machine learning.\n As the leading development platform for online and mobile games, Unity is helping developers\n take their creations further and faster than ever before.\n \nYou will own the implementation of one or more app store abstraction layers, conforming the\n app stores to our unified, simple API. You will contribute to features enhancing the usability and\n effectiveness of IAP. You will collaborate with the Unity engineering team in Copenhagen,\n Helsinki and elsewhere, using email, Slack, and Skype. You will write C++ in the Unity engine,\n C# in the scripting layer, and use a handful of additional technologies for the platforms that we\n support — such iOS, Android, PC, Mac, and Web.\n \nResponsibilities\n \n \n Write high-quality code that sets an example \n Work with stakeholders to gather requirements \n Design solutions to fulfill the requirements \n Design public APIs used by Unity’s customers \n Work with test engineers to ensure high-quality delivery of the product \n \nRequirements\n \n \n Bachelor's degree in Computer Science or equivalent experience \n 3+ years experience as a professional developer with strengths in both C++ and C# \n Mobile development experience \n Passion about building tools for game developers \n Experience with Java and either Swift or Objective-C \n Excellent verbal and written communication skills with the ability to build relationships \n \nacross the enterprise\n \n Drive for and comfort with representing the customer experience to stakeholders \n Ability to manage complexity and fix difficult bugs \n Ability to thrive in a fast-paced and high-growth startup environment \n Strong organization and time management skills \n \nBonus Points\n \n \n Experience developing free-to-play games \n Experience using the Google Play or iOS App Store APIs \n Experience working with remote/international teams \n Prior experience with API design and architecture \n Experience developing with Unity \n \nWho We Are\n \nWe are product-driven, curious, and creative. We aggressively reinvest in development to keep\n Unity moving and evolving - from expanding usability and power, to platform reach. With over a\n billion installs per month, Unity touches gamers and non-gamers alike. As well as video games,\n our software is used in industries as diverse as medicine, visualization and shopping -\n democratizing game development while solving hard problems and enabling success for a huge\n range of developers worldwide.\n \nToday, Unity has expanded to over 15 international offices and has employees in 23 countries.\n Every person at Unity Technologies has an inherent passion and driven spirit and it isn’t enough\n to be able to do the job- we’re looking for people that color outside the lines, are looking to be\n freed from the process tangle, and can dream big!\n \nHeadhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.\n \nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n \nUnity is an equal opportunity employer committed to providing employment opportunities without regard to race, color, sex (including gender identity, sexual orientation, and pregnancy), age, national origin, religion, veteran status, disability, genetic information, or any other protected status in accordance with applicable law."},
{"job_desc": " Position Overview: \nThe Climate Corporation is revolutionizing the agriculture industry with a platform and products that are helping the world’s farmers sustainably increase productivity with digital tools. We are leveraging Machine Learning and Big Data to build meaningful products that allow farmers to produce enough food to help feed a growing population.​ Our Seeds, Planting and Fertility team takes the insights from our models and turns them into actionable insights for our growers.\n We are looking for a talented Staff Backend Engineer to join our team to help build the services and features that bring these insights to life for our growers. In this role you will take Machine Learning based recommendation models and build them into our product in a scalable, performant and personalized way. If you are passionate about innovation and excited about being a key contributor to building a sustainable business, we would love to talk to you!\n \n What You Will Do: \nDesign and implement highly scalable microservice-based sync/async services and deploy on public cloud\n Work with data ranging from farm-collected precision agriculture data to remote sensed satellite imagery\n Develop scalable distributed platforms to process high volume, computationally intensive data and scientific models using functional or object oriented languages.\n Implement efficient algorithms and services for diverse and challenging precision agriculture applications\n Produce high quality code and constantly address technical debt\n Represent Climate and present at local meetups, user groups and conferences\n Continuously develop and release applications with great unit and application test coverage.\n \n Basic Qualifications: \nDegree in computer science or related scientific field\n At least 5 years experience with functional or object oriented language (Java, C++, Clojure, Scala etc)\n At least 2 years experience with deployment in large cloud based distributed environment (AWS, Azure or Google Cloud)\n \n Preferred Qualifications: \nExperience with Amazon Web Services (EC2, S3, RDS, SQS, etc.) (Strong Plus)\n Knowledge of functional programming (Strong Plus)\n Experience with compiled JVM language (Java, Scala, Clojure) (Strong Plus)\n Experience with at least one distributed computing platform (Hadoop, Spark, etc.)\n Experience with messaging paradigms and middlewares. (SQS, JMS etc)\n Experience working with persistence store (Relational or Nonrelational)\n Contributor to open-source projects\n Experience and interest in machine learning.\n Experience with version control systems. Git is preferred.\n Excellent written and verbal communication, presentation, and listening skills with the ability to present complex technical information in a clear and concise manner.\n Strong knowledge of software development methodologies and best practices.\n \n What We Offer: \nOur teams are composed of industry experts, top scientists, and talented engineers. The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best possible products and experiences for our customers.\n We provide competitive salaries and some of the best perks in the industry, including:\n Superb medical, dental, vision, life, disability benefits, and a 401k matching program\n A stocked kitchen with a large assortment of snacks & drinks to get you through the day\n Encouragement to get out of the office and into the field with agents and farmers to see first-hand how our products are being used\n We take part and offer various workshops, conferences, meet-up groups, tech-talks, and hackathons to encourage participation and growth in both community involvement and career development\n \n We also hinge our cultural DNA on these five values: \nInspire one another\n Innovate in all we do\n Leave a mark on the world\n Find the possible in the impossible\n Be direct and transparent\n \n Learn more about our team and our mission: \nThe Climate Corporation - The Technology Behind Making A Difference\n https://youtu.be/c5TgbpE9UBI or visit https://climate.com/careers\n \n#LI-SS1"},
{"job_desc": " About Uber\n We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. \n \nFor the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. \n \nAnd that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. \n About the Role \n \nThe Operations Experience group aims to make every Uber Freight operations person a superhero. This means you will build fast, informative tools to speed up the workflows around creating, selling, and booking freight; it means being passionate about automation to maintain a lean, quality-focused organization even as we scale dramatically; it means building predictive models and alerting mechanisms so we can address loads at risk of operational failure before the problems ever happen. \n What You'll Do \nCreate tools and services to grow our Freight business.\n Work closely with our operations team, product managers, designers and customer to build technologies to fuel the hyper growth of Uber Freight! \nWork across the stack from database schema design decisions to backend services to tweaking CSS. \n \nWhat You'll Need \nMinimum of 4 years experience. \nBS/MS/Phd in Computer Science or related field required \nDemonstrated experience shipping high-quality product features on schedule \nCommand of a frontend stack (Javascript/HTML/CSS). Frameworks like React/Flux/Redux or Angular.js are a plus. \nKnowledge of a backend stack, including technologies like Golang, Java, Node.js, and how they interface with Redis, Kafka, or similar. \nBias toward action. You believe that speed and quality aren't mutually exclusive. You've shown good judgment about shipping as fast as possible while ensuring your products and platforms are built in a sustainable, responsible way-and you're comfortable making mistakes, provided you learn from them. \nUnquenchable thirst for growth. You're not just looking for the next interesting challenge, but looking to push yourself to keep pace in our high growth environment. \nWillingness to mentor. In a full-stack role, you are a polyglot, but maybe speak one language more fluently than another. Help those that are the reverse! \n \nAbout the Team \n Trucks move everything you buy, why shouldn’t booking a truck be as seamless as booking an Uber? \n \nUber Freight connects shippers with carriers / truck drivers, much like the way the Uber connects riders and drivers. The Uber Freight team believes that empowering truck drivers will bring more open, efficient, and increasingly safer transportation to our roads. We are a team of sharp, entrepreneurial individuals who are redefining the movement of goods around the world. We are currently looking for candidates to join our growing team who share our enthusiasm for tackling today’s toughest challenges in transportation."},
{"job_desc": " The Challenge:\n We are looking for someone who loves building services for the creative professional and implementing features across the full Web Solution Stack – ours is Linux, Nginx, Node 8 or PHP 7, Postgres using Docker.\n What you'll do:\n You’ll be working as part of a team, creating innovative new features and maintaining existing ones for Adobe Stock (stock.adobe.com) and underlying micro services. The perfect candidate will need a keen eye for details and high standards for code quality and efficiency. Knowledge of best practices in building scalable applications is highly desirable. Candidates who enjoy tackling complex technical challenges, have a passion for delighting customers and who are self-motivated to push themselves in a team oriented culture will thrive in our environment.\n What you’ll need to succeed:\n Experience developing consumer facing web sites built with micro services using Node and/or Java, PHP, JavaScript, HTML, and CSS\n Experience with test-driven and behavior-driven development and tools (e.g. Mocha, Sinon, cypress, Jasmine, PHPunit)\n Knowledge of best practices and SOLID design principles in object oriented programming\n Knowledge of security best practices (e.g. SQL injection, XSS and other exploits)\n Solid knowledge of JavaScript and related libraries or tools (Webpack, ES6, Express, Redux)\n Excellent trouble shooting skills across layered systems/services\n Front End Engineers should have a good knowledge of CSS (SCSS, bootstrap3, OOCSS, BEM) and HTML5\n BS in Computer Science or a related field\n Passion for Software Engineering\n At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists . You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.\n If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.\n Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age , sexual orientation, gender identity, disability or veteran status."},
{"job_desc": " Job Summary The Full-Stack Ecommerce Developer is a hands-on technical position who is comfortable designing and coding, and participating in all the required project related activities. This includes providing an on-going project status in Daily Stand-Up, design storming, code review, knowledge transfer, and others. Beyond technical capabilities we are also looking for a person who can take diverse business requirements and turn them into actionable software work items. The ideal candidate will have had experience in the high paced energy of start-ups as well as experience in the structured world of larger companies. This position will need to have strong Java software engineering experience and UI expertise. The successful applicant will work closely with Business Analysts, Technical Leads, Software Engineers, Operations, and Quality Assurance Engineers in a highly collaborative environment to provide quality software and solutions. Responsibilities and Duties Clear understanding of multi-tier Web application architecture Architect, designing, writing and implementing Java applications on Linux Front-end and Back-end development Participates in the full SDLC (Agile), including meetings, iterative development, estimations and design sessions Deliver project assignments on time and with high quality Work with business analysts to understand and implement complex business functionality Collaborating with Architects, QA, and other Software Engineering resources in designing, implementing and integrating enterprise solutions Work with distributed teams across various time zones Qualifications and Skills Bachelor’s Degree required 5+ years full life cycle software development of J2EE project and development experience Experience using front end technologies such as HTML5, CSS, JavaScript, JQuery, JSON, XML, REST, Node.js, Backbone.js Experience with Spring MVC and other core Spring features required Strong SQL and DB skills (Oracle Preferred) Experience with open source based technology stack -- Maven, Tomcat, Solr Experience with Hibernate and ORM familiarity Familiarity with source control concepts and tools such as GIT Experience with Agile/Scrum software development methodologies Experience with TDD is a strong plus Ability and desire to take product/project ownership Ability to thrive in a can-do proactive environment Job Type: Contract Salary: $100,000.00 to $140,000.00 /year Required experience: J2EE: 5 years Required education: Bachelor's Job Location: San Francisco, CA"},
{"job_desc": " Location: San Carlos, CA\n \nJob Type: Full-time\n \nSummary:\n \nNamed Best New Product for the Underserved by the Center of Financial Services Innovation and the global winner of the G20 Innovation Award for Financial Inclusion, JUNTOS builds mobile personal financial management tools for the financially underserved across four continents. Our team combines high technology with empathy-driven design to increase financial inclusion around the world.\n \n \nSoftware Engineer, Data Engineering\n \n \nAt JUNTOS, being an engineer is about more than solving interesting problems, it’s about applying the power of exceptional engineering to truly meaningful global challenges.\n \n \nData is central to JUNTOS’ ability to carry out its mission. Data Engineering ensures that the company has the right data, in the right form, when and where it’s needed. We maintain a balance of rigor and agility as the company scales its operations. As software engineer, you build simple and effective solutions by drawing creatively from your broad set of skills and tools.\n \n \nIf you’ve always dreamed of using your skills to make an impact, we’d love to talk to you.\n \n \nEssential to the position:\n \n \nMinimum 2 years of industry experience\n \nExcellent communication skills, whether in prose or data visualization\n \nDiligence in coordinating changes to our systems with their stakeholders\n \nLiteracy in statistical concepts like power, error, and bias\n \nProficiency with SQL database design and management (we use PostgreSQL)\n \nPreferred qualifications:\n \n \nLiteracy in R, Ruby, and Rails (much of our existing infrastructure is written with these)\n \nExperience with, or an enthusiasm to learn, Python, Spark, and surrounding ecosystem\n \nCompensation: $100-$130k salary, plus equity\n \n \nJuntos is venture backed by Aligned Partners and Omidyar Network and headquartered in San Carlos, CA. To apply, send a CV and a cover letter explaining why this position & Juntos are appealing to you to join theteam .Background check will be required upon employment."},
{"job_desc": " Title: Software Engineer \n We are looking for a passionate engineer to join our expanding team. \n You would be spending a lot of time with cutting edge technology solutions for major clients including chatbot design and development, augmented reality, and more. \n Idea Evolver specializes in content marketing, search experience optimization and technology. \n Notable clients include Dannon, AstraZeneca, United Therapeutics, and K. Hovnanian Homes. \n Qualifications \n Proven ability to meet deadlines and deliver solutions quickly at a high quality \n Experience developing websites and web applications leveraging popular open source CRMs \n Advanced understanding of implementing responsive, highly performant front-end interfaces for the web\n Please include at least one link to a live application that showcases your front-end implementation talents \n Experience with Amazon Web Services: ec2, s3, route53, elb, elastic beanstalk, rds, lex, lambda, api gateway, etc. \n Advanced understanding of one or more of the following: Python, RoR, Node.js, PHP, Go \n You should have at least one production application shipped using a modern JS framework \n Experience with automated testing frameworks \n Must be able to manage a development project from beginning to end \n Compensation and Benefits \n Competitive salary \n Excellent health and dental \n 401k \n 15 paid days off plus holidays \n Gym membership \n Workstation includes the newest equipment"},
{"job_desc": " About Science Exchange\n We are a small team working to improve the quality and efficiency of scientific research. We are well funded and fast growing. As part of our team you'll have a big impact on our mission from the moment you start. You will be joining passionate and talented folks who have great fun working together.\n \nOur Engineering Team\n We are a group of builders from diverse backgrounds. Our work style is supportive and collaborative.\n \nSalary and Benefits\n We offer a competitive competitive salary, full benefits and other perks, which you can read about on our main jobs page.\n Role & Responsibilities content\n \nDevelop new features for our main application, the Science Exchange marketplace (a Ruby on Rails app).\n \nContribute to internal tools that help us scale our processes as we grow.\n \nShare the responsibility for keeping our codebase robust and pleasant to work with.\n \nBuild sites and tools to support our validation-related projects, such as the\n \nReproducibility Initiative\n \n.\n \nCollaborate to plan work, do code reviews, and improve our practices and processes.\n \nParticipate in recruiting and interviewing.\n \nHave fun learning with us as we grow and change the scientific collaboration landscape.\n \nThis position has a backend or full-stack orientation.\n \ntext Qualities & Qualifications content\n \nProficient with the fundamentals of programming, especially as they apply to web development.\n \nFamiliar with modern web development technologies and paradigms.\n \nA strong learner, with the capacity to grow and adapt.\n \nA good communicator and collaborator.\n \nPassionate about building useful things.\n \ntext Keyword Soup content\n \nWeb development frameworks, like Django or Ruby on Rails.\n \nFront-end frameworks, such as Ember.js, Angular.js or Node.js.\n \nThe Ruby programming language (our current language of choice).\n \nDatabases, especially SQL and its feeding and care.\n \nBuilding beautiful, dynamic web-pages with CSS and JavaScript.\n \nInterest or experience with scientific research."},
{"job_desc": " Amazon Music – Any Way You Want It.\n \n \nImagine being a part of an agile team where your ideas have the potential to reach millions. Picture working on cutting-edge consumer-facing products, where every single team member is a critical voice in the decision-making process. Envision being able to leverage the resources of a Fortune-500 company within the atmosphere of a start-up. Welcome to Amazon Music, where ideas are born and come to life as Amazon Music Unlimited, Prime Music, and so much more.\n \n \nEveryone on our team has a meaningful impact on product features, new directions in music streaming, and customer engagement. We are looking for new team members across a variety of job functions including software engineering/development, marketing, design, ops and more. Come join us as we make history by launching exciting new projects in the coming year.\n \n \nOur team is focused on building a personalized, curated, and seamless music experience. We want to help our customers discover up-and-coming artists, while also having access to their favorite established musicians. We build systems that are distributed on a large scale, spanning our music apps, web player, and voice-forward audio engagement on mobile and Amazon Echo devices, powered by Alexa to support our customer base. Amazon Music offerings are available in countries around the world, and our applications support our mission of delivering music to customers in new and exciting ways that enhance their day-to-day lives.\n \n \nCome innovate with the Amazon Music team!\n \n \n Basic Qualifications\n Bachelor’s Degree in Computer Science or a related field\n 3+ years of software development experience using Java or C++\n Computer Science fundamentals in object-oriented design, data structures and algorithm design, and complexity analysis\n \n Preferred Qualifications\n Graduate degree in a related technical field\n Experience releasing highly scalable enterprise products full life cycle\n Experience with critical, 24x7 systems\n Experience with high throughput, multi-threaded systems\n Experience implementing and consuming large scale web services\n Experience with Lucene-based search, Elasticsearch, or Solr\n Fluency in programming languages beyond Java and C++ (e.g. Ruby, Python, Perl)\n Experience with AWS services highly desirable\n \nAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n \n \n#MusicJobs"},
{"job_desc": " As a software engineer on the Protect and Integrity teams, you’ll build back-end systems that directly enable product surfaces to filter unsafe content. Your systems will process reporting signals from our 200+ million active users to enable a trustworthy experience on Pinterest. Your work is an essential part of ensuring content safety for our 100+ billion pins.\n \n What you’ll do: \n \n Design and develop highly reliable back-end systems \n Develop end-to-end solutions for user review, compliance, trust and safety, pin quality, and ad quality \n Integrate machine learned signals with large-scale filtering infrastructure \n Innovate on our tool-set to address trust and safety of our internationally growing user base \n \n What we’re looking for: \n \n CS degree and 5+ years relevant industry experience \n Expertise in design of scalable systems with experience in MySQL, Kafka, NoSQL, Hive and Big Data processing \n Exceptional ability to work anywhere in the stack \n Proficiency in Python or similar programming language \n Experience in web frameworks or large scale distributed systems is a plus \n \n"},
{"job_desc": " The target location for this position is the San Francisco Bay Area.\n \nAt Pocket we love what we do, but more importantly we are building something that millions of people love, too. Pocket has become essential to how people discover and consume content worthy of their time and attention. Over 30 million people have saved more than 3 billion articles and videos to Pocket to-date.\n \nIf you are passionate about using technology to improve people's lives, we believe Pocket has challenges in front of us that will excite you. We're a small team that has the resources of a large company (Pocket was acquired by Mozilla in 2017) and that means lots of opportunity to own things from start to finish that have tremendous impact on large numbers of people, across many different devices and platforms.\n \nWith millions of people discovering and consuming content across the Pocket platform, our community generates one of the most unique and interesting sets of data on the web. We are looking to expand our team to help achieve our mission of advancing access to and discovery of high-quality, personalized content across the web. If you are interested in applying your engineering skills to help design, test and launch new data-driven features and products that allow people to focus and become more knowledgeable about the things that interest them, then Pocket might be the place for you!\n \n---------------------\n \n What you’ll do: \n---------------------\n \n \n Embody the \"voice of the data\" - advising our product, engineering and business operations teams and providing input on everything we build, test and analyze. \n Productize, iterate, ship and scale recommendation systems that power user-facing features used by millions of people every day. \n Conceptualize, design and prototype new uses of our data set to enrich the Pocket user experience. \n Contribute to a world-class team and shape the future of data at Pocket. \n \n------------\n \n Who you are: \n------------\n \n \n You love combining data + engineering and problem solving how to create incredible experiences at their intersection. \n You have an academic background in computer science or equivalent work experience. \n You have at least 2 years professional experience and direct experience and/or passion around data science topics like NLP, IR, Search and/or ML. Consumer-facing product experience a plus. \n You are a strong programmer with experience with PHP, Python, Ruby, Go, Java or equivalent (and comfortable writing code without support of frameworks). \n You have worked with large, complex data sets and used statistics, data mining and modeling to extract useful data and insights. \n You possess strong communication skills and an ability to approach problems in a structured way and distill complex issues into actionable insights. \n You stay current with the latest/most relevant data science technologies and trends. \n While not required, any direct experience with text mining and parsing, neural networks, classification, designing and implementing data pipelines, Elasticsearch or equivalent is all considered a plus. \n \n------------\n About Pocket\n ------------\n \nPocket (Read It Later, Inc) was founded in 2007 by Nate Weiner to help people save interesting articles, videos and more from the web for later enjoyment. Once saved to Pocket, the list of content is visible on any device — phone, tablet or computer. It can be viewed while waiting in line, on the couch, during commutes or travel — even offline.\n \nThe world's leading save-for-later service currently has more than 30 million registered users and is integrated into more than 1,500 apps. It is available for major devices and platforms including iPad, iPhone, Android, Mac, Kindle Fire, Kobo, Google Chrome, Safari, Firefox, Opera and Windows\n \nLearn more on our blog ( https://getpocket.com/blog/ ). To learn more about the Mozilla acquisition of Pocket, please visit our blog ( https://blog.mozilla.org/blog/2017/02/27/mozilla-acquires-pocket/ ).\n \nMozilla is committed to Equal Employment Opportunity throughout our recruiting and hiring process and is dedicated to growing diversity in our workplace.\n \nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."},
{"job_desc": " Job Description:\n \n * Develop flowcharts, layouts and documentation to identify requirements and solutions\n * Write well-designed, testable code\n * Produce specifications and determine operational feasibility\n * Integrate software components into a fully functional software system\n * Develop software verification plans and quality assurance procedures\n * Document and maintain software functionality\n * Troubleshoot, debug and upgrade existing systems\n * Deploy programs and evaluate user feedback\n * Comply with project plans and industry standards\n * Ensure software is updated with latest features\n Job Skills:\n * Proven work experience as a Software Engineer or Software Developer\n * Experience designing interactive applications\n * Ability to develop software in Java, Ruby on Rails, C++ or other programming languages\n * Excellent knowledge of relational databases, SQL and ORM technologies\n \n* Experience developing web applications using at least one popular web framework\n * Experience with test-driven development\n * Proficiency in software engineering tools\n * Ability to document requirements and specifications\n * BSc degree in Computer Science, Engineering or relevant field"},
{"job_desc": " Amazon Music – Any Way You Want It.\n \n \nAmazon Music is looking for a talented Software Engineer to join us in revolutionizing the digital music customer experience. You will work on Amazon's leading digital music products. We have a focus on quality, so we like modular, reusable designs, continuous integration, and automated test frameworks. At Amazon Music, our environment frees up developers to do what they do best: innovate and implement. We love to work with smart people who have a strong sense of ownership and strong engineering mindset.\n \n \nYou are highly-motivated and thrive in an environment where problems are open-ended. You enjoy engaging in passionate discussions and letting the best ideas rise to the top. You see your mistakes as learning opportunities and continually look for ways to improve yourself, your team and your products. You think a millisecond sounds like a really long time. You understand that not all solutions come easily and don’t shy away from hard work to reach your goals. You are excited about the opportunity to engage in developing a top notch consumer application and user experience.\n \n \nPosition Overview\n \n You will be responsible for the design and implementation of software used by millions of users.\n You will be interacting and cooperating with other developers at Amazon Music.\n You will be developing a rich hybrid desktop application using advanced C++, Javascript and CSS.\n \n Basic Qualifications\n \n Bachelor’s Degree in Computer Science or a related field\n 3+ year(s) of development experience using C++\n Computer Science fundamentals in object-oriented design, data structures and algorithm design, and complexity analysis\n Experience developing on Windows and/or OS X.\n Familiarity with additional languages such as (Java, Perl, Ruby, etc)\n Familiarity with HTML, CSS, Javascript and general Web 2.0 techniques\n Familiarity developing with AJAX libraries and frameworks (e.g. JQuery, Underscore, Backbone, etc.)\n \n Preferred Qualifications\n \n Experience developing high-quality cross-platform applications\n Ability to learn and adapt to new, complex development environments\n Firm understanding of software development principles\n Experienced in all stages of development, including design, development, testing, and deployment\n Passion for solving complex problems with efficient algorithms.\n Passion for creating efficient, scalable interfaces.\n Analytical skills, excellent communication skills, and strong team ethic\n \nAmazon.com is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n \n \n#MusicJobs"},
{"job_desc": " Academia is looking for a Full-Stack Software Engineer to join our team!\n \n \n What we're looking for  \nOur ideal candidates are not only great at what they do, but they also make a meaningful impact on our mission. You should have experience working with the full stack of a web application. You are excited about and understand front end and robust app server architecture, and scalable backend design.\n \n \nBonus points for experience scaling an application to handle an increasing user base or having the ambition to put your scaling ideas into practice. Familiarity with our current tools is a plus, but it's much more important that you be a fast learner who can pick up new technologies quickly.\n \n \n What will you build?  \nAcademia’s mission is to make every academic paper published available for free.\n \n \nAcademia's platform has scaled to over 59M registered users, and over 6M monthly active users. You'll be designing and building systems and services to make our user base more productive in their academic work life. You'll be working on such systems as:  \n* communications and messaging tools to facilitate collaboration and feedback  \n* an engaging and scalable peer review system to facilitate the identification & wide-scale distribution of high quality academic research  \n* A scalable newsfeed, highlighting the latest research in every field  \n* tools and platforms that enable academics to publish directly on the Academia social network  \n* advanced search products and personalized analytics\n \n \n What impact will you have?  \nYour work will impact millions of scholars, making knowledge more accessible and fostering discussion among scholars.\n \n \n What will you get?  \nIn addition to finding great talent for our tight-knit team, we value fostering employee growth. Our 25-person team values curiosity, initiative, teamwork, and we are passionate about building great products. We have an employee-focused benefits program that includes top notch health, dental, and vision insurance, a generous time off policy (21-days paid vacation, 10 federal holidays, and unrestricted sick-leave), stock options, catered lunch, a stocked kitchen, and a book stipend. We’re located near MUNI & BART in beautiful downtown San Francisco.\n \n \n What to expect from the Interview  \nAt Academia, we believe in strong computer science fundamentals. If you're unfamiliar with parts of our stack, that's not a problem as long as you're hungry to learn. We're more interested in your abilities as a software engineer. You will be given the opportunity to meet most of the engineers on our team, plus the CTO and the CEO. Conversations will range from personal interests, to your resume background. We want to understand your problem-solving skills and your ability to write structured, scalable, production level code. During the interview process, you'll be given a logic problem and you'll be asked to write code to solve the problem. We view this as a discussion, and we're more interested in the way you think rather than that you got the right answer.\n \n \n The Academia Story  \nFounded in 2008, Academia.edu is the leading online platform for academics worldwide. Our site accelerates research and supports critical breakthroughs in medicine, science, transportation and communications by allowing researchers to publish and share their own work. Not only do these scholars and researchers share their own research, they can use our complex platform to monitor deep analytics around the impact of their research, and track the research of academics they follow. We have more than 25 employees at our San Francisco Office, with 17 in engineering.\n \n \nOver 59 million academics are Academia.edu members, adding 20 million papers. Academia.edu attracts over 39 million unique visitors a month and has an investment of more than $28 million from leading VC firms including Khosla Ventures, True Ventures, Spark Capital and Tencent. Our work has garnered favorable attention from trade and mainstream media including Fortune, Wired, EdTech, Venture Beat, San Francisco Business Times, The Economist, The Washington Post, TechCrunch, Scientific American and Forbes.\n \n \nAcademia has turned cash flow positive; our revenue run rate is over $10M/year and growing rapidly.\n \n \nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n \n \n Technologies we use\n Ruby on Rails, React (to make our FE more responsive), RSpec and Jasmine for testing, PostgreSQL for data storage, Redis for in-memory data structures, Elasticsearch for our full-text search engine, Kafka for our publish-subscribe messaging, Neo4J for managing our email lists, all working with EC2 spot instances and autoscaling, and Ansible for configuration management.\n \n Requirements\n Solid CS fundamentals; Bachelor's Degree in Computer Science or related major strongly preferred\n Recent college grads OR 2-5+ years of large scale web application development in a Unix/Linux environment\n Strong knowledge of web services architecture, and the ability to quickly learn new technologies\n Proficiency with Ruby, Python, or other scripting language is preferred but not required\n Understanding, creating and manipulating and querying databases\n API/back-end coding in one or more languages e.g. Ruby, Java, Python, etc.\n Front-end coding experience in one or more languages, e.g. HTML, JavaScript, Java, etc., is preferred but not required.\n \nAPPLY"},
{"job_desc": " Build software. Reach 500 million users. Change lives. That’s what we’re doing at Lithium. And you can do it, too. If you want to put your stamp on the digital customer space and enjoy yourself along the way, come join the team. We’re looking for seriously passionate, fun, collaborative & innovative thinkers to help us change the world.\n \n2-4+ years’ commercial experience in Java Web application development or other Object Oriented Programming language (OOP), including proficient UI skills.\n \nStrong skills in Java development experience, preferably in large scale Web environments\n \nStrong UI skills and experience with HTML5, HTTP2, CSS3, JavaScript\n \nExperience in one or more MVC architectures ( experience with Spring is a plus)\n \nExperience in one or more Client side MVC architectures (experience with Angular is a plus)\n \nAbility to handle complex problems well\n \nAbility solve problems independently\n \nAbility to learn quickly\n \nAbility to clearly communicate complex problems to both engineers and non-engineers\n \nB.S. in Computer Science or other relevant technical field\n \nHIGHLY DESIRED EXPERIENCE IN ONE OR MORE OF THE FOLLOWING AREAS:\n \nA passion for Social Media\n \nTapestry 5 experience\n \nExperience creating consumer facing web applications\n \nProven track record of identifying and championing new technologies that enhance the, software quality, developer productivity, and end-user experience\n \nAbout Lithium\n \nLithium's software helps companies reinvent how they connect with their customers. We work with more than 300 of the world's best brands to respond on social networks and to build trusted content on a community they own. Lithium reaches more than 500 million consumers across 10,000 specific interest areas to establish trust and reputation. Together, we represent one of the biggest collections of data on consumer attitudes, preferences and digital activities. Our 100% SaaS-based Lithium Social Customer Experience™ platform enables brands to build and engage vibrant customer communities to drive sales, reduce service costs, accelerate innovation and grow brand advocacy. We are experiencing rapid growth and are recognized as a leader by top analyst firms, including Gartner and Forrester. And because our culture is as exciting as our products, we’ve been ranked as one of Glassdoor’s Best Place to Work. Come check us out!\n \nLithium will consider all qualified applicants, regardless of race, color, religion, sex, national origin, age, disability, veteran status, genetic information or criminal history."},
{"job_desc": " Job Description: \nUpstart is a fast-growing and profitable company revolutionizing how people access credit. We use data science and automation to make smarter lending decisions and help borrowers access credit easier and faster. And we need amazing engineers to make that happen.\n \nWe’re looking for curious and humble team members driven by a desire to move quickly, build robust systems, and improve people’s lives. Our engineers work on all aspects of the Upstart platform, from our data prediction model to our backend financial platform, to our web interfaces and 3rd party API integrations. You'll enjoy significant autonomy in architecting systems, writing algorithms, and crafting elegant user interfaces. Our team is broken into product-oriented squads, giving engineers direct access to the end-user and the ability to launch features without being blocked. We’ve also designed the squad system to enable constant learning: engineers have the chance to rotate squads every 6 months to learn new parts of the codebase and business. Do you want to learn a new language or a new skill? There's a squad here to learn from. You'll also get the chance to solve challenges with interesting engineering constraints, work in a distributed system, and collaborate with data scientists.\n \nWe're in business of predictions, and we've predicted these skills are a good fit to be successful at Upstart:\n \n \n 2+ years of full-stack web development \n Experience with event-driven and event-sourced systems \n Experience with web frameworks (Ruby on Rails preferred) and JavaScript / JS framework (React preferred) \n Experience with SQL databases and domain modeling \n Analytical and problem solving skills \n Self-motivated and enjoys collaborating with a team \n \n About Upstart: \nUpstart is the first lending platform to leverage artificial intelligence and machine learning to price credit and automate the borrowing process. ~80% of U.S. borrowers pay back their loans, yet only ~45% of these people have access to prime credit. Our engineering team uses non-conventional variables at scale in an underwriting model that improves constantly to solve this problem. Upstart was founded by three diverse leaders that bring their individual approach to Upstart creating a culture where “we get to the truth, move fast, and bring everyone in.” Based in San Carlos, CA, Upstart is backed by Google Ventures, KPCB, Khosla Ventures, Founders Fund, First Round Capital, Eric Schmidt, and Mark Cuban."},
{"job_desc": " Overview: \nJoin a smart, tight-knit incubation and development team focused on Internet Of Things (IoT).\n As a full stack developer, you will be working closely with other team members within an agile multi-functional team, to write high quality, efficient, groundbreaking front-end code which uses the latest web technologies. You will also design and build RESTful web services for the Splunk Enterprise platform that are performant, scalable and reliable.\n You will also participate constructively in requirements analysis and design discussions and collaborate closely with product managers, architects and front-end developers. Requirements:\n 2+ years of professional or open source web application development with JavaScript, HTML, CSS\n 1+ year of professional or open source development of RESTful web services\n Ability to learn new technologies quickly and apply them to solve challenging problems.\n Strong communication skills:  verbal, written and whiteboard.\n \n BS CS/EE or equivalent Additional skills: \nImplementing automated tests and code coverage in a CI/CD pipeline\n You have basic familiarity with Java and Python\n You have experience coding in a “functional programming” style.\n You have experience working on high-performance software that processes massive amounts of data in an efficient manner.\n You have experience building scalable solutions that are delivered in the cloud.\n You are a generalist, a quick learner and keep yourself abreast with computing trends. What We Offer You:\n A constant stream of new things for you to learn. We're always expanding into new areas, bringing in open source projects and contributing back, and exploring new technologies.\n A set of exceptionally talented and dedicated peers, all the way from engineering and QA to product management and customer support.\n A stable, collaborative and supportive work environment.\n We don't expect people to work 12 hour days. We want you to have a successful time outside of work too. Want to work from home sometimes? No problem. We trust our colleagues to be responsible with their time and dedication, and believe that balance helps nurture an exceptional environment.\n We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status"},
{"job_desc": " Looking for a company that inspires passion, courage and imagination, where you can be part of the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay – a company you can be proud to be a part of. Looking for a company that inspires passion, courage and imagination, where you can be part of the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to creating an ambitious and inclusive workplace, join eBay – a company you can be proud to be a part of. Like to shake things up? We do! eBay hires innovators who can push boundaries and change the world. Get inside the heads of our users to design and build the exceptional experiences they don’t even know they need yet. Bring your creative ideas, and help develop groundbreaking user interfaces. We are looking for a motivated front-end developer to write high – quality, high performance, and maintainable front-end code while focusing on scalability, security, cross-browser compatibility, web standards, interoperability, and accessibility. We want the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward. You’ll work alongside the best and the brightest engineering talent in the industry. As a core participant of your team, you’ll estimate engineering efforts, prioritize projects, plan implementations, and triage production issues. You need to be dynamic, collaborative, and curious as we build new experiences, improve existing products, and develop distributed systems powering the world’s largest e-commerce websites at a scale few companies can match. You are - Insightful. Be able to evaluate user needs and desires, and translate those into viable designs and products - Resourceful. Have the ability to do a lot with a little. Be able to aggregate information from various places and build relationships with key stakeholders to get the information you need - Tech Savvy. Master your tools, and continue to expand your systems knowledge through formal or informal research and training. We need: - UI expertise. Know design, know what users are looking for, and know how to bring that to life - Programming. Be proficient with JavaScript, CSS, HTML, JQuery, AngularJS and/or JS Frameworks. - A go-getter. Take on new opportunities, don’t shy away from challenges, and bring energy and enthusiasm to the office every day. Basic Qualifications: - Completed a Master's degree from an accredited College or University in Computer Science or related major -Strong applied experience. You’ve built, broken, and rebuilt software applications - Creative thinker who knows how to create real-world products - Proficiency in programming languages including: Java, Python, C++ -Experience using NodeJS, Javascript, CSS and HTML Available to work in one of the following locations: - San Jose, CA - San Francisco, CA - Brisbane, CA - Bellevue, WA - Portland, OR - New York, NY is a Subsidiary of eBay. Disclaimer: Please note that by applying to this role, you are agreeing to be considered for multiple positions. This is a general description of the qualifications and skills required for positions of this type of role. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies View our privacy policy View our accessibility info\n R0019688-4"},
{"job_desc": " Job Summary We are looking for a Full Stack Engineer to help us build and iterate on our product. We use Ruby on Rails for our API and AngularJS for our front end. Responsibilities and Duties Back end API development: Creating new and maintaining existing API endpoints for our Ruby on Rails back end; Writing specs (unit tests) to ensure that our API endpoints are behaving as expected Front end web development using AngularJS, Sass, and CoffeeScript Feature implementation and follow-through Pairing and collaborating on software development Qualifications and Skills Required skills and experience:  Professional web app development experience Familiarity with common best-practice software design patterns and principles (object oriented programming, proper data structure usage, etc.) SQL database experience JavaScript HTML and CSS Excellent communication skills Desired skills and experience:  Rails and ActiveRecord Experience with Angular or React Experience with distributed version control systems, preferably Git Ability to take initiative and manage upwards Other requirements:  You must be legally authorized to work in the United States You must be able to work at our downtown San Francisco office Benefits Full health benefits (e.g. medical, dental, and vision insurance) 401k Commuter benefits Customizable workstations (e.g. Apple laptops, large displays, adjustable standing desks) Convenient location, 10 minute walk from Montgomery BART Job Type: Full-time Salary: $100,000.00 to $120,000.00 /year Required experience: Professional Software Development: 2 years Required education: Bachelor's"},
{"job_desc": " Company Overview\n Riverbed solutions help companies transition from legacy hardware to a new software-defined and cloud-centric approach to networking and application delivery for the digital age. The Riverbed Application Performance Platform™ takes Riverbed’s SD-WAN solution for agile networking that really works, and adds to this digital backbone industry-leading solutions for WAN optimization and hybrid networking, for branch IT orchestration, and for end-to-end visibility from device to cloud. All these solutions are integrated in a flexible, modular, digital architecture that delivers any apps, data and services from any public or private cloud across any network to any end-point, with the best possible user experience as determined by business policy. \n \nRiverbed is a pre-IPO opportunity with over $1 billion in annual revenue headquartered in San Francisco with branch offices around the globe. \n About this Position\n Riverbed is actively seeking Software Engineers to help build the next generation of software-defined networking infrastructure. We are looking for developers with an interest in Software Defined Networking (SDN), distributed control plane algorithms, network overlays, and underlay dynamic routing protocols. As a member of this team, you will be in charge of designing and implementing high performance network service functions and a control plane that scales to thousands of nodes across a wide-area-network. \n \nWhat you ‘ll do: \n \nDesign and develop new features and improvements for SDWAN solutions on SteelConnect \nIdentify improvement areas and architect elegant, optimal solutions \nCommunicate clearly with peers and stakeholders about ideas, designs, and implementation details \nWork closely with fellow engineers to arrive at consensus-based approaches to problems \nWork with QA to explain new features and assist in test-plan development \nTroubleshoot complex customer issues that require deep understanding of network protocols and Linux networking internals \n \nWhat you should have: \n \n3-5 years of hands on software development experience \nDeep understanding of TCP/IP & Routing protocols (OSPF, BGP) \nHands-on programming experience in both user and Linux kernel space \nGood understanding of the Linux networking internals \nExperience in data plane and control plane architecture \nExperience in variety of development languages including C, C++ and Python \nStrong computer science fundamentals: data structures, algorithms, programming languages, distributed systems, computer networking, multi-threaded programming \nStrong software design, development and debugging skills \nBachelor or MS degree in Computer Science \n About Riverbed\n Why Riverbed Technology? \n \nIf you are a high-achiever who wants to be part of a dynamically growing, billion dollar plus company, then you should look closely at Riverbed. We offer the rewarding experience of working with the best minds in the industry that are changing the world through cutting edge technology and applications. The company has been recognized multiple years for attracting and retaining today’s top talent as a great place to work by Glassdoor, Fortune magazine’s 20 Great Workplaces in Tech and by numerous other publications. \n \nLearn more at www.riverbed.com. \n \nRiverbed is proud to be an affirmative action (AA) and equal employment opportunities (EEO) employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability. \n LI-JG1"},
{"job_desc": " About Us\n Blueshift’s AI-Powered Marketing Platform empowers cutting edge B2C brands to drive 1:1 marketing on every channel. Blueshift is based in San Francisco and building a “Segment of One Marketing Automation” solution used by consumer marketers. With Blueshift, marketers are in full control of automating various forms of personalized messaging across multiple channels including email, mobile push notifications & Facebook. The company is founded by repeat entrepreneurs who previously built Mertado.com (acquired by Groupon to become Groupon Goods), and were part of the early team behind Kosmix (acquired by Walmart to become @WalmartLabs), and backed by top tier VC firms.\n \nBlueshift's SaaS platform is used by marketers at leading brands such as Udacity, LendingTree, BBC, PayPal among others. The company is backed by top tier VCs like Storm Ventures & Nexus Venture Partners.\n \nFull Stack Engineer\n Blueshift is looking for an extraordinary full stack software developer with focus on frontend to reimagine how companies engage with their customers. You will have a chance to work on all aspects of product vision, UX, systems architecture and algorithms design.\n \nResponsibilities\n \n Be a full stack engineer and lead development of intelligent and intuitive systems from back to front. \n Build/Enhance Blueshift's messaging orchestration engine that processes millions of data points \n Design, develop and deploy pixel perfect web interfaces that delight users \n Build a product for marketers that will help them manage millions of users as easy as targeting a \"Segment of one\". \n \nRequirements\n \n Proven experience with web frameworks such as Ruby on Rails & Angular.js \n Expert experience with HTML, CSS and JS frameworks \n Experience working with distributed systems \n Bachelors/Masters in Computer Science or related fields \n Build REST driven APIs to build modular, extensible and robust applications \n Strong presentation and communication skills \n High energy, a passion for high quality software and ability to work with a small team \n Experience working with scalable, real-time systems a plus \n \nPerks\n \n Full health, dental, vision insurance \n Unlimited vacation \n Flexible spending accounts for transportation and parking \n Life insurance & disability coverage \n Generous equity grants and competitive salary \n Company will process visa transfers (H1b, TN etc.) and immigration. \n Located in heart of SF FD/SOMA next to BART and close to Caltrain \n \n"},
{"job_desc": " Description\n \nHelp us build a powerful platform from the ground up, that will enable companies to make better business decisions through real-time \"what if\" scenarios, gauge the ripple effects of changing market conditions across the enterprise, and take action immediately.\n \nWe are seeking a seasoned full stack software engineer to play a central role in the design, development, and delivery of user-facing features and backend services. This is your opportunity to make a large impact at a growing company.\n \nResponsibilities\n \nAs a full-stack developer, you will play a central role in the design, development, and delivery of user-facing features for Alight's platform. The ideal candidate will have a passion for creating high-quality user experiences working closely with our skilled product owners, UI/UX designers and engineers.\n \nYou should have solid experience building dynamic web pages using JavaScript, AngularJS, and Node.js. As an Alight engineer, you will be part of a small cross-functional, agile team where you will have continued opportunity to learn and grow.\n \nAs a growing startup, we look for self-starters who thrive in a fast-paced, agile environment – which means wearing many hats, being able to change direction quickly, and showing an eagerness to learn new technologies as the need arises. In this role you work with a small, collaborative cross functional team – so excellent interpersonal and communication skills are also a must. Most importantly – we look for people who can prioritize, take ownership, and deliver – because it’s a lot more fun to get things done.\n \nSkills and Requirements\n \n \n 3+ years of solid experience with JavaScript and one of the major JavaScript MVC frameworks (Angular, Ember, React, Backbone) \n Experience with Node.js or developing backend services or APIs using other technologies \n Knowledge of AngularJS practices based on extensive work experience \n Creating self-contained, reusable, and testable modules and components \n Writing extensive unit tests using automated TDD tasks \n Creating e2e test suites for all components, and running them with Protractor (or a well reasoned alternative) \n Strong grasp of software engineering principles and practices \n Prior experience with or understanding of REST (or designing APIs) highly desirable \n Bachelor’s degree in Computer Science, Engineering or equivalent \n Experience with NoSQL database technologies is a plus \n \nWhy Alight?\n \n \n Competitive compensation, benefits, and a culture supporting a life outside of work \n Paid holidays and flexible paid time off \n Your choice between Mac or PC \n An activity for you: ping pong, after work running, cactus growing competition \n Downtown San Francisco location close to BART \n Find plenty of food in the kitchen \n First Fridays! We stop work early on the first Friday of each month, break out food and libations, celebrate monthly birthdays with cake, bet on the Super Bowl, celebrate the holidays, and generally enjoy each other’s company \n \n"},
{"job_desc": " About Us\n \nLyte is a post-primary ticketing platform for sold out events which means we’ve partnered with some of the biggest names in the live entertainment industry to help eliminate the secondary market (scalping) and save fans money when buying tickets to sold out shows. We work directly with the promoters, artists, and venues as an extension of the primary box office, helping them control their events end-to-end.\n \n Qualities that we are looking for in our team: \nDevelopers that are passionate about building APIs, infrastructure and backend platform services.\n Ability to collaborate closely with front-end and product teams to deliver a holistic experience that's optimized around providing the best user experience possible.\n Software engineers who are passionate about finding simple solutions to complex problems, excel at solving real issues for real people and want to push the boundaries of their engineering abilities.\n \n What you will have ownership for delivering: \nBuild, design and implement scalable, robust and reliable web applications and RESTful API services.\n Help drive the design and architecture of API, data and algorithmic services.\n Write code to develop new software products and/or features, manage individual project priorities, deadlines and deliverables.\n Collaborate with product, design, marketing, growth, and support to define and deliver product roadmaps\n Identify opportunities and implement solutions to improve engineering productivity.\n \n Skills needed to be successful: \n2+ years of experience working as a software engineer\n Experience working with Python/Django in a production environment.\n Experience working with SQL and NoSQL data stores such as PostgreSQL & Redis\n Experience working with AWS services include RDS, S3, and EC2\n Experience working in Agile teams."},
{"job_desc": " We are:  A team of engineers and finance geeks revolutionizing the finance service industry. Backed by BlackRock, we are a B2B2C enterprise SAAS company making software that allows our customers to retire in style.\n \nWe’re growing at a rapid rate and we are looking to build new technology and processes to scale our business. We’re looking for team members who want to build impactful solutions to a really challenging problem: producing better financial outcomes for families.\n \n Job Description: \nWe’re growing at a rapid rate and we are looking to build new technology to scale our business. We’re looking for team members who want to build impactful solutions to a really challenging problem: producing better financial outcomes for families.\n \n ROLE/RESPONSIBILITIES: \nWorking with their engineering manager, scrum master and teammates in an agile environment to deliver quality features.\n Learning new technology and looking to expand your skills as an engineer.\n Writing quality maintainable and testable code\n Performing code reviews and providing timely feedback to other engineers\n \n BASIC QUALIFICATIONS: \nBA/BS in Computer Science or related technical field\n At least 1+ years of software development experience\n At least 1+ years working with Backbone, Angular or react and SASS.\n At least 1+ years working with Ruby on Rails and MySQL\n \n PREFERRED QUALIFICATIONS: \nAn interest in and/or passion for improving the financial futures of everyday Americans\n Be resourceful and able to work independently with while communicating effectively with the team: self-starter/self-motivated\n Strong written and verbal communication skills\n FutureAdvisor is proud to be an Equal Opportunity and Affirmative Action Employer. We evaluate qualified applicants without regard to race, color, national origin, religion, sex, disability, veteran status, and other statuses protected by law.\n \nFutureAdvisor will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code."},
{"job_desc": " Google aspires to be an organization that reflects the globally diverse audience that our products and technology serve. We believe that in addition to hiring the best talent, a diversity of perspectives, ideas and cultures leads to the creation of better products and services.\n \n \nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n \n \nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n \n \n Responsibilities\n Design, develop, test, deploy, maintain and improve software.\n Manage individual project priorities, deadlines and deliverables.\n \n Qualifications\n Minimum qualifications:\n BS degree in Computer Science, similar technical field of study or equivalent practical experience.\n Software development experience in one or more general purpose programming languages.\n Experience working with two or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, and/or security software development.\n Working proficiency and communication skills in verbal and written English.\n \nPreferred qualifications:\n Master’s, PhD degree, further education or experience in engineering, computer science or other technical related field.\n Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or Go.\n Experience developing accessible technologies.\n Interest and ability to learn other coding languages as needed."},
{"job_desc": " WHAT WE'RE BUILDING\n \nEden is the leading platform for office management – where teams can collaborate to have all the services they need to thrive at work. Our mission is to create a better place to work, for everyone.\n \nWe're looking for fantastic engineers who can work harder, faster, and smarter without sacrificing technical excellence. Our organizational challenges are unique, and we are rapidly defining an enormous new industry, so you should be excited to build systems that can support the way that the office will run in the future.\n \nAs a full time software engineer, you'll have a direct impact on the customer experience and on-site Wizard experience. We are ambitious, engaged and excited about building the most innovative services platform of all time. Unlike most technology companies, we touch people from all ways of life, and Eden has both a digital and physical product in our technology and people.\n \nSKILLS & ATTRIBUTES\n \n \n Fast learner -- We're looking for software engineers who thrive on learning new technologies and want to build something that will be used by many. You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment. You have advanced knowledge of at least one scripting language (e.g. Ruby or Python) and knowledge of or eagerness to learn: PostgreSQL, Redis, and ElasticSearch. \n Attention-to-Detail -- You strive to prove that speed and quality are not conflicting; you can achieve both at the same time. \n Versatility -- In addition to having an intimate knowledge of the whole web stack, you understand how all the pieces fit together (front-end, database, network layer, etc.) and how they impact the performance of your application. \n Passion -- You feel ownership over everything you ship; you'd never call code \"released\" until you're confident it's correct. You pride yourself on efficient monitoring, strong documentation, and proper test coverage. You have sound judgment. \n Team player -- You believe that you can achieve more on a team than you ever could alone. You rely and thrive on others' candid feedback for continuous improvement. \n Design and business acumen -- You understand requirements beyond the written word. Whether you're working on an API used by other developers, an internal tool consumed by our operation teams, or a feature designed for thousands of customers, your attention to details leads to a delightful user experience. \n \nBASIC QUALIFICATIONS\n \n \n Bachelors, Masters or PhD in Computer Science, Engineering or a related technical discipline. \n Experience in at least one scripting language (e.g. Ruby or Python) \n Demonstrated software engineering experience through previous internships, work experience, coding competitions, and/or publications \n \nPERKS\n \n \n Ground floor opportunity with the team; shape the strategic direction of a fast-growing Y Combinator startup \n Be part of a company that uniquely leverages technology to empower a diverse range of people \n Fun office environment \n Competitive salary \n Full benefits (medical, dental, vision) \n Generous stock options \n Daily lunch in the office + snacks \n Lyft / Uber reimbursements \n 401(k) contribution opportunity \n Cool swag \n Great location in the SOMA district of SF \n \nEden is the leading platform for office management. Our mission is to create a better place to work, for everyone. Our platform provides services ranging from office cleaning and facilities maintenance to supply and snack stocking to IT support. Each Eden client has a dedicated account manager to ensure an insanely great experience. Eden is venture-backed from some of the best institutional and angel investors in Silicon Valley, including Y Combinator, SV Angel, Redpoint Ventures, Bessemer Venture Partners, Canvas Ventures, Index Ventures, Comcast Ventures, ENIAC, Maven Ventures, Slow Ventures, and many more.\n \nWe were founded in 2015 and currently serve the San Francisco Bay Area, LA, Austin, and NY."},
{"job_desc": " Mountain View,California,United States 6J7BP1\n Primary Responsibilities:\n Assists with the documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems.\n Develops and maintains code and integrates software components into a fully functional software system.\n Assists with test procedures and documenting test results to ensure software system requirements are met.\n Gathers information to support software project management. \nDocuments deployed processes and tools and collect metrics.\n Supports software research and development projects.\n Troubleshoots basic software issues.\n Works under close supervision.\n Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world. \nBoeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world. \nC++,\n Java,\n Phyton,\n Matlab.\n Any experience industry developing real-time applications a plus. \nDegree and typical experience in engineering classification: Bachelor's or a Master's degree with experience. \nYes, 10 % of the Time Autonomous Systems Individual Contributor No No Standard United States; The Boeing Company"}
]